general/english/en_vocab.org
#+setupfile: ../../styles/readtheorg.setup
#+title: English Vocabulary

* A
** accountable

*adj.1* \\
[ responsible | liable ] \\
[ require || expect ]d to justify [ action || decision ]s \\
(of a [ person || organization | institution ]) \\
: Government must be [ accountable ] to its citizens.

*adj.2* \\
< hold accountable for > \\
: the investigative journalism that [ holds ] government [ accountable ]
: The government was [ held accountable for ] the food shortage.
: The president had committed crimes and should be [ held accountable for ] them.

** address

*vt.1* \\
to speak to \\
: [ addressed ] me in low tones
: He [ addressed ] the crowd outside the window.
: The two ministers did not [ address ] each other directly.

*vt.2* \\
to lecture \\
to talk to an audience formally \\
to direct a [ speech | statement ] to \\
to [ make , deliver ] a formal speech to \\
: [ addressed ] the union members at the convention
: The chairman [ addressed ] the board of trustees.
: 他下周要在一个人权会议上[ 发言 ]。>> He will [ address ] a conference on human rights next week.

*vt.3* \\
to refer to \\
to greet with a prescribed [ form || title || name ] \\
to use a specified [ form || title ] in [ speak , write ]ing to \\
to call (a person to whom one is speaking) by a particular [ name || term ] \\
: to [ address ] the judge as "Your Honor"
: He always [ addresses ] me with "Sir".

*vt.4* \\
to approach \\
to direct to the attention of \\
to bring a [ appeal | request ] to the attention of \\
=+= message, warning \\
: to [ address ] a protest to the faculty senate
: She [ addressed ] her remarks to all.
: He [ addressed ] himself to the chairman.

*vt.5* \\
to direct \\
to mark with a destination \\
to put the directions for delivery on \\
=+= letter, parcel \\
: She absentmindedly [ addressed ] the envelope with the wrong name.
: 申请信应该寄给商务编辑。>> Applications should be [ addressed ] to: The business affairs editor. 

*vt.6* \\
to apply oneself to \\
to direct the [ energy | efforts || attention ] towards \\
: to [ address ] oneself to a task

*vt.7* \\
to discuss \\
to [ deal with | treat of | handle  ] \\
act on verbally or in some form of artistic expression \\
=+= issue, problem \\
: [ addressed ] the issue of taxes
: Chapter 10 [ addresses ] the problem of transitivity.
** aforementioned

*adj.1* \\
denoting a [ thing , person ] previously mentioned
: songs from the [ aforementioned ] album

** agenda

*n.1* \\
[ plan | scheme ] \\
the underlying [ intention | motive ]s of a particular [ person , group ] \\
: their hidden [ agenda ]
: Miller has his own [ agenda ] and it has nothing to do with football.

** allegedly

*adv.1* \\
[ reportedly | supposedly ] \\
used to convey that sth. is claimed to be the case, although there is no proof \\
: He was [ allegedly ] a leading participant in the coup attempt.

