general/english/en_vocab.html
---
title: "English Vocabulary"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>English Vocabulary</title>
<!-- 2016-10-26 周三 22:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">English Vocabulary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A</a>
<ul>
<li><a href="#sec-1-1">1.1. accountable</a></li>
<li><a href="#sec-1-2">1.2. address</a></li>
<li><a href="#sec-1-3">1.3. aforementioned</a></li>
<li><a href="#sec-1-4">1.4. agenda</a></li>
<li><a href="#sec-1-5">1.5. allegedly</a></li>
<li><a href="#sec-1-6">1.6. alternative</a></li>
<li><a href="#sec-1-7">1.7. appreciation</a></li>
<li><a href="#sec-1-8">1.8. arise</a></li>
</ul>
</li>
<li><a href="#sec-2">2. B</a>
<ul>
<li><a href="#sec-2-1">2.1. badly</a></li>
<li><a href="#sec-2-2">2.2. bother</a></li>
</ul>
</li>
<li><a href="#sec-3">3. C</a>
<ul>
<li><a href="#sec-3-1">3.1. canonical</a></li>
<li><a href="#sec-3-2">3.2. catalyze</a></li>
<li><a href="#sec-3-3">3.3. claim</a></li>
<li><a href="#sec-3-4">3.4. coming</a></li>
<li><a href="#sec-3-5">3.5. compelling</a></li>
<li><a href="#sec-3-6">3.6. conceivable</a></li>
<li><a href="#sec-3-7">3.7. conceive</a></li>
<li><a href="#sec-3-8">3.8. contemplate</a></li>
<li><a href="#sec-3-9">3.9. contextual</a></li>
<li><a href="#sec-3-10">3.10. convenient</a></li>
<li><a href="#sec-3-11">3.11. conversely</a></li>
<li><a href="#sec-3-12">3.12. conversion</a></li>
<li><a href="#sec-3-13">3.13. costly</a></li>
<li><a href="#sec-3-14">3.14. covert</a></li>
<li><a href="#sec-3-15">3.15. credential</a></li>
<li><a href="#sec-3-16">3.16. credit</a></li>
<li><a href="#sec-3-17">3.17. criterion</a></li>
</ul>
</li>
<li><a href="#sec-4">4. D</a>
<ul>
<li><a href="#sec-4-1">4.1. deteriorate</a></li>
<li><a href="#sec-4-2">4.2. devise</a></li>
<li><a href="#sec-4-3">4.3. dictate</a></li>
<li><a href="#sec-4-4">4.4. dismay</a></li>
<li><a href="#sec-4-5">4.5. dispatch</a></li>
<li><a href="#sec-4-6">4.6. drain</a></li>
<li><a href="#sec-4-7">4.7. dwell</a></li>
</ul>
</li>
<li><a href="#sec-5">5. E</a>
<ul>
<li><a href="#sec-5-1">5.1. emerge</a></li>
<li><a href="#sec-5-2">5.2. employ</a></li>
<li><a href="#sec-5-3">5.3. entail</a></li>
<li><a href="#sec-5-4">5.4. equivalent</a></li>
<li><a href="#sec-5-5">5.5. exploit</a></li>
<li><a href="#sec-5-6">5.6. extroverted</a></li>
</ul>
</li>
<li><a href="#sec-6">6. F</a>
<ul>
<li><a href="#sec-6-1">6.1. factual</a></li>
<li><a href="#sec-6-2">6.2. familiarity</a></li>
</ul>
</li>
<li><a href="#sec-7">7. G</a>
<ul>
<li><a href="#sec-7-1">7.1. gauge</a></li>
</ul>
</li>
<li><a href="#sec-8">8. H</a>
<ul>
<li><a href="#sec-8-1">8.1. hurdle</a></li>
</ul>
</li>
<li><a href="#sec-9">9. I</a>
<ul>
<li><a href="#sec-9-1">9.1. immediate</a></li>
<li><a href="#sec-9-2">9.2. implication</a></li>
<li><a href="#sec-9-3">9.3. incentive</a></li>
<li><a href="#sec-9-4">9.4. indifferent</a></li>
<li><a href="#sec-9-5">9.5. indulge</a></li>
<li><a href="#sec-9-6">9.6. intangible</a></li>
<li><a href="#sec-9-7">9.7. intensive</a></li>
<li><a href="#sec-9-8">9.8. intent</a></li>
<li><a href="#sec-9-9">9.9. internalize</a></li>
<li><a href="#sec-9-10">9.10. intuition</a></li>
</ul>
</li>
<li><a href="#sec-10">10. J</a>
<ul>
<li><a href="#sec-10-1">10.1. jargon</a></li>
</ul>
</li>
<li><a href="#sec-11">11. L</a>
<ul>
<li><a href="#sec-11-1">11.1. languish</a></li>
<li><a href="#sec-11-2">11.2. largely</a></li>
<li><a href="#sec-11-3">11.3. long-standing</a></li>
</ul>
</li>
<li><a href="#sec-12">12. N</a>
<ul>
<li><a href="#sec-12-1">12.1. negligible</a></li>
<li><a href="#sec-12-2">12.2. no-brainer</a></li>
</ul>
</li>
<li><a href="#sec-13">13. O</a>
<ul>
<li><a href="#sec-13-1">13.1. offbeat</a></li>
<li><a href="#sec-13-2">13.2. overall</a></li>
<li><a href="#sec-13-3">13.3. overwhelming</a></li>
</ul>
</li>
<li><a href="#sec-14">14. P</a>
<ul>
<li><a href="#sec-14-1">14.1. painstaking</a></li>
<li><a href="#sec-14-2">14.2. particularly</a></li>
<li><a href="#sec-14-3">14.3. perception</a></li>
<li><a href="#sec-14-4">14.4. perpetual</a></li>
<li><a href="#sec-14-5">14.5. plainly</a></li>
<li><a href="#sec-14-6">14.6. plausible</a></li>
<li><a href="#sec-14-7">14.7. preoccupied</a></li>
<li><a href="#sec-14-8">14.8. predicament</a></li>
<li><a href="#sec-14-9">14.9. preliminary</a></li>
<li><a href="#sec-14-10">14.10. premature</a></li>
<li><a href="#sec-14-11">14.11. premise</a></li>
<li><a href="#sec-14-12">14.12. prerequisite</a></li>
</ul>
</li>
<li><a href="#sec-15">15. R</a>
<ul>
<li><a href="#sec-15-1">15.1. rig</a></li>
</ul>
</li>
<li><a href="#sec-16">16. S</a>
<ul>
<li><a href="#sec-16-1">16.1. save</a></li>
<li><a href="#sec-16-2">16.2. seed</a></li>
<li><a href="#sec-16-3">16.3. supplement</a></li>
</ul>
</li>
<li><a href="#sec-17">17. W</a>
<ul>
<li><a href="#sec-17-1">17.1. wear</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> accountable</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>adj.1</b> <br  />
[ responsible | liable ] <br  />
[ require || expect ]d to justify [ action || decision ]s <br  />
(of a [ person || organization | institution ]) <br  />
</p>
<pre class="example">
Government must be [ accountable ] to its citizens.
</pre>

<p>
<b>adj.2</b> <br  />
&lt; hold accountable for &gt; <br  />
</p>
<pre class="example">
the investigative journalism that [ holds ] government [ accountable ]
The government was [ held accountable for ] the food shortage.
The president had committed crimes and should be [ held accountable for ] them.
</pre>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> address</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>vt.1</b> <br  />
to speak to <br  />
</p>
<pre class="example">
[ addressed ] me in low tones
He [ addressed ] the crowd outside the window.
The two ministers did not [ address ] each other directly.
</pre>

<p>
<b>vt.2</b> <br  />
to lecture <br  />
to talk to an audience formally <br  />
to direct a [ speech | statement ] to <br  />
to [ make , deliver ] a formal speech to <br  />
</p>
<pre class="example">
[ addressed ] the union members at the convention
The chairman [ addressed ] the board of trustees.
他下周要在一个人权会议上[ 发言 ]。&gt;&gt; He will [ address ] a conference on human rights next week.
</pre>

<p>
<b>vt.3</b> <br  />
to refer to <br  />
to greet with a prescribed [ form || title || name ] <br  />
to use a specified [ form || title ] in [ speak , write ]ing to <br  />
to call (a person to whom one is speaking) by a particular [ name || term ] <br  />
</p>
<pre class="example">
to [ address ] the judge as "Your Honor"
He always [ addresses ] me with "Sir".
</pre>

<p>
<b>vt.4</b> <br  />
to approach <br  />
to direct to the attention of <br  />
to bring a [ appeal | request ] to the attention of <br  />
<code>+</code> message, warning <br  />
</p>
<pre class="example">
to [ address ] a protest to the faculty senate
She [ addressed ] her remarks to all.
He [ addressed ] himself to the chairman.
</pre>

<p>
<b>vt.5</b> <br  />
to direct <br  />
to mark with a destination <br  />
to put the directions for delivery on <br  />
<code>+</code> letter, parcel <br  />
</p>
<pre class="example">
She absentmindedly [ addressed ] the envelope with the wrong name.
申请信应该寄给商务编辑。&gt;&gt; Applications should be [ addressed ] to: The business affairs editor. 
</pre>

<p>
<b>vt.6</b> <br  />
to apply oneself to <br  />
to direct the [ energy | efforts || attention ] towards <br  />
</p>
<pre class="example">
to [ address ] oneself to a task
</pre>

<p>
<b>vt.7</b> <br  />
to discuss <br  />
to [ deal with | treat of | handle  ] <br  />
act on verbally or in some form of artistic expression <br  />
<code>+</code> issue, problem <br  />
</p>
<pre class="example">
[ addressed ] the issue of taxes
Chapter 10 [ addresses ] the problem of transitivity.
</pre>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> aforementioned</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>adj.1</b> <br  />
denoting a [ thing , person ] previously mentioned
</p>
<pre class="example">
songs from the [ aforementioned ] album
</pre>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> agenda</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>n.1</b> <br  />
[ plan | scheme ] <br  />
the underlying [ intention | motive ]s of a particular [ person , group ] <br  />
</p>
<pre class="example">
their hidden [ agenda ]
Miller has his own [ agenda ] and it has nothing to do with football.
</pre>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> allegedly</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<b>adv.1</b> <br  />
[ reportedly | supposedly ] <br  />
used to convey that sth. is claimed to be the case, although there is no proof <br  />
</p>
<pre class="example">
He was [ allegedly ] a leading participant in the coup attempt.
</pre>
</div>
</div>
