general/english/en_vocab.org
** alternative

*n.1* \\
<alternative to> \\
[ option | choice ] \\
one of a number of things from which only one can be chosen \\
a [ choice || course ] of action that is mutually exclusive with another \\
: We took the [ alternative ] of walking.
: The [ alternative ] to riding is walking.
: The [ alternative ] to staying in that dead-end job is to quit.
: New treatments may provide an [ alternative ] to painkillers.
: Food suppliers are working hard to provide organic [ alternatives ] to everyday foodstuffs.

*n.2* \\
a choice limited to one of two or more possibilities \\
one of a number of possible [ choice , course of action ]s \\
a possibility of choice, esp. between two [ thing , course of action ]s \\
: the [ alternative ] of riding or walking
: There are plenty of [ alternatives ] to conventional advertising.

*n.3* \\
a [ possible , remaining ] choice \\
a situation presenting a choice between two mutually exclusive possibilities \\
: no [ alternative ] but to walk
: If a man is threatened with attack, he has five [ alternatives ] ...
: People facing the [ alternative ] of selling their homes or going bankrupt.
** appreciation

*n.1* \\
[ understanding | recognition | awareness | knowledge ] \\
a full understanding of a situation \\
: an [ appreciation ] of the difficulties involved
: They have an [ appreciation ] of the needs of users.

** arise

*vi.1* \\
to [ originate | appear | emerge ] \\
to take on form \\
to [ come into being | come into existence ] \\
problem, question =+=
: New problems [ arise ] daily.
: hoped that a new spirit of freedom was [ arising ]

*vi.2* \\
< arise from > \\
to [ result | issue ] \\
to have as a source \\
to [ spring | proceed ] as a consequence \\
consequence =+=
: guilt [ arising from ] my actions
: the consequences [ arising from ] this action
: mistakes that [ arise from ] a basic misunderstanding
: A slight unpleasantness [ arose from ] this discussion.

*vi.3* \\
to [ rise | get up ] \\
to rise to one's feet \\
to adopt a standing posture \\
(as from a [ sitting || kneeling || lying || prone ] position)
: He [ arose ] from his chair.

*vi.4* \\
to [ ascend | lift | move upward ] \\
to move from a lower to a higher position
: the flat terrace, from which [ arises ] the volume of the house
: The smoke [ arose ] from the forest fire.

*vi.5* \\
to [ awaken | wake up ]
: He [ arose ] at 6:30 a.m. as usual.
* B
** badly

*adv.1* \\
[ incorrectly | inaccurately | unsuccessfully ] \\
in a [ displeasing | unsatisfactory || inadequate || unskilled ] manner \\
perform, play =+=
: to speak German [ badly ]
: I think he paints very [ badly ].
: Our scheme worked out [ badly ].
: He performed [ badly ] on the exam.
: 整个项目管理得[ 差劲 ]。>> The whole project was badly [ managed ].
: 我生气因为我弹得这么[ 糟 ]。>> I was angry because I played so [ badly ].

*adv.2* \\
[ poorly | defectively | inadequately ] \\
=+= made, designed, written
: The room was so [ badly ] lit I couldn't see what I was doing.
: You may have to work part-time, in a [ badly ] paid job with unsociable hours.

*adv.3* \\
[ severely | gravely | direly ] \\
with great intensity \\
to a [ severe | serious ] degree \\
=+= hurt, injured, damaged
: fingers so [ badly ] frozen they had to be amputated
: I cut myself [ badly ].
: It was a gamble that went [ badly ] wrong.
: The building was [ badly ] damaged in the explosion.
: 一男子死亡，另一个受[ 重 ]伤。>> One man was killed and another [ badly ] injured.
: 炸弹炸毁了一个警察局，还[ 严重 ]毁坏了一座教堂。>> The bomb destroyed a police station and [ badly ] damaged a church.

*adv.4* \\
[ greatly | strongly | very much ] \\
to a great [ extent | degree ] \\
want, need =+=
: I want this job so [ badly ].
: We [ badly ] need the money.
: I am [ badly ] in need of advice.
: I wanted it [ badly ] enough to work hard for it.
: 你为什么要[ 这么 ]急着走？>> Why do you want to go so [ badly ]?

*adv.5* \\
[ improperly | naughtily | wickedly] \\
in a [ naughty | disobedient | socially wrong ] way \\
behave =+=

*adv.6* \\
[ cruelly | evilly | wrongly ] \\
without humanity \\
in a [ wicked | evil | morally wrong | legally wrong ] way \\
treat =+=
: He treated his parents [ badly ].
: 他们俩都表现得极不友善，这令我很伤心。>> They have both behaved very [ badly ] and I am very hurt.

*adv.7* \\
[ unfavourably |  with disapproval ] \\
to sb.'s disadvantage \\
in a disadvantageous way \\
speak, think =+=
: She spoke [ badly ] of him.
: The venture turned out [ badly ] for the investors.
: They thought [ badly ] of him for his lack of concern.

*adv.8* \\
<to take sth. badly> \\
with [ great || unusual ] [ distress || resentment || regret || emotional display ]
: She [ took ] the news [ badly ].
: They [ took ] their defeat [ badly ].
: She [ took ] her father's death [ badly ].

*adv.9* \\
regretfully
: He felt [ badly ] about it.
