general/english/en_vocab.html
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> alternative</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<b>n.1</b> <br  />
&lt;alternative to&gt; <br  />
[ option | choice ] <br  />
one of a number of things from which only one can be chosen <br  />
a [ choice || course ] of action that is mutually exclusive with another <br  />
</p>
<pre class="example">
We took the [ alternative ] of walking.
The [ alternative ] to riding is walking.
The [ alternative ] to staying in that dead-end job is to quit.
New treatments may provide an [ alternative ] to painkillers.
Food suppliers are working hard to provide organic [ alternatives ] to everyday foodstuffs.
</pre>

<p>
<b>n.2</b> <br  />
a choice limited to one of two or more possibilities <br  />
one of a number of possible [ choice , course of action ]s <br  />
a possibility of choice, esp. between two [ thing , course of action ]s <br  />
</p>
<pre class="example">
the [ alternative ] of riding or walking
There are plenty of [ alternatives ] to conventional advertising.
</pre>

<p>
<b>n.3</b> <br  />
a [ possible , remaining ] choice <br  />
a situation presenting a choice between two mutually exclusive possibilities <br  />
</p>
<pre class="example">
no [ alternative ] but to walk
If a man is threatened with attack, he has five [ alternatives ] ...
People facing the [ alternative ] of selling their homes or going bankrupt.
</pre>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> appreciation</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<b>n.1</b> <br  />
[ understanding | recognition | awareness | knowledge ] <br  />
a full understanding of a situation <br  />
</p>
<pre class="example">
an [ appreciation ] of the difficulties involved
They have an [ appreciation ] of the needs of users.
</pre>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> arise</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<b>vi.1</b> <br  />
to [ originate | appear | emerge ] <br  />
to take on form <br  />
to [ come into being | come into existence ] <br  />
problem, question <code>+</code>
</p>
<pre class="example">
New problems [ arise ] daily.
hoped that a new spirit of freedom was [ arising ]
</pre>

<p>
<b>vi.2</b> <br  />
&lt; arise from &gt; <br  />
to [ result | issue ] <br  />
to have as a source <br  />
to [ spring | proceed ] as a consequence <br  />
consequence <code>+</code>
</p>
<pre class="example">
guilt [ arising from ] my actions
the consequences [ arising from ] this action
mistakes that [ arise from ] a basic misunderstanding
A slight unpleasantness [ arose from ] this discussion.
</pre>

<p>
<b>vi.3</b> <br  />
to [ rise | get up ] <br  />
to rise to one's feet <br  />
to adopt a standing posture <br  />
(as from a [ sitting || kneeling || lying || prone ] position)
</p>
<pre class="example">
He [ arose ] from his chair.
</pre>

<p>
<b>vi.4</b> <br  />
to [ ascend | lift | move upward ] <br  />
to move from a lower to a higher position
</p>
<pre class="example">
the flat terrace, from which [ arises ] the volume of the house
The smoke [ arose ] from the forest fire.
</pre>

<p>
<b>vi.5</b> <br  />
to [ awaken | wake up ]
</p>
<pre class="example">
He [ arose ] at 6:30 a.m. as usual.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> B</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> badly</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>adv.1</b> <br  />
[ incorrectly | inaccurately | unsuccessfully ] <br  />
in a [ displeasing | unsatisfactory || inadequate || unskilled ] manner <br  />
perform, play <code>+</code>
</p>
<pre class="example">
to speak German [ badly ]
I think he paints very [ badly ].
Our scheme worked out [ badly ].
He performed [ badly ] on the exam.
整个项目管理得[ 差劲 ]。&gt;&gt; The whole project was badly [ managed ].
我生气因为我弹得这么[ 糟 ]。&gt;&gt; I was angry because I played so [ badly ].
</pre>

<p>
<b>adv.2</b> <br  />
[ poorly | defectively | inadequately ] <br  />
<code>+</code> made, designed, written
</p>
<pre class="example">
The room was so [ badly ] lit I couldn't see what I was doing.
You may have to work part-time, in a [ badly ] paid job with unsociable hours.
</pre>

<p>
<b>adv.3</b> <br  />
[ severely | gravely | direly ] <br  />
with great intensity <br  />
to a [ severe | serious ] degree <br  />
<code>+</code> hurt, injured, damaged
</p>
<pre class="example">
fingers so [ badly ] frozen they had to be amputated
I cut myself [ badly ].
It was a gamble that went [ badly ] wrong.
The building was [ badly ] damaged in the explosion.
一男子死亡，另一个受[ 重 ]伤。&gt;&gt; One man was killed and another [ badly ] injured.
炸弹炸毁了一个警察局，还[ 严重 ]毁坏了一座教堂。&gt;&gt; The bomb destroyed a police station and [ badly ] damaged a church.
</pre>

<p>
<b>adv.4</b> <br  />
[ greatly | strongly | very much ] <br  />
to a great [ extent | degree ] <br  />
want, need <code>+</code>
</p>
<pre class="example">
I want this job so [ badly ].
We [ badly ] need the money.
I am [ badly ] in need of advice.
I wanted it [ badly ] enough to work hard for it.
你为什么要[ 这么 ]急着走？&gt;&gt; Why do you want to go so [ badly ]?
</pre>

<p>
<b>adv.5</b> <br  />
[ improperly | naughtily | wickedly] <br  />
in a [ naughty | disobedient | socially wrong ] way <br  />
behave <code>+</code>
</p>

<p>
<b>adv.6</b> <br  />
[ cruelly | evilly | wrongly ] <br  />
without humanity <br  />
in a [ wicked | evil | morally wrong | legally wrong ] way <br  />
treat <code>+</code>
</p>
<pre class="example">
He treated his parents [ badly ].
他们俩都表现得极不友善，这令我很伤心。&gt;&gt; They have both behaved very [ badly ] and I am very hurt.
</pre>

<p>
<b>adv.7</b> <br  />
[ unfavourably |  with disapproval ] <br  />
to sb.'s disadvantage <br  />
in a disadvantageous way <br  />
speak, think <code>+</code>
</p>
<pre class="example">
She spoke [ badly ] of him.
The venture turned out [ badly ] for the investors.
They thought [ badly ] of him for his lack of concern.
</pre>

<p>
<b>adv.8</b> <br  />
&lt;to take sth. badly&gt; <br  />
with [ great || unusual ] [ distress || resentment || regret || emotional display ]
</p>
<pre class="example">
She [ took ] the news [ badly ].
They [ took ] their defeat [ badly ].
She [ took ] her father's death [ badly ].
</pre>

<p>
<b>adv.9</b> <br  />
regretfully
</p>
<pre class="example">
He felt [ badly ] about it.
</pre>
</div>
</div>
