general/english/en_vocab.org
** bother

*vt.1* \\
to [ trouble | annoy | disturb | pester | irritate ] \\
to cause to be irritated \\
to trouble the [ nerves , peace of mind ] of \\
(esp. by minor irritations) \\
(esp. by repeated [ vexation | act ]s) \\
noise =+=
: Stop [ bothering ] your father!
: Mosquitoes buzzing in my ear really [ bothers ] me.
: I don't know why he [ bothers ] me with this kind of rubbish.

*vt.2* \\
to [ upset | worry | distress || alarm ] \\
to make [ nervous || agitated ] \\
thought =+=
: That kind of jealousy doesn't [ bother ] me.
: The thought of her husband's return clearly [ bothered ] her.
: The mere thought of her [ bothered ] him and made his heart beat faster.
: 有什么事让你[ 烦恼 ]吗？>> Is something [ bothering ] you?
: 让我[ 烦恼 ]的是，男孩们对我不感兴趣。>> It [ bothered ] me that boys weren't interested in me.

*vt.3* \\
*to take the [ time , trouble ] (to do sth.)* \\
*to concern oneself with (accomplishing sth.)* \\
: Don't [ bother ] to come with me.
: Most of the papers didn't even [ bother ] reporting it.
: 很多人如今不[ 费心 ]举办婚礼了。>> Lots of people don't [ bother ] to go through a marriage ceremony these days.
: 不管我做什么都没有区别，那为什么还要[ 费心 ]去做呢？>> Nothing I do makes any difference anyway, so why [ bother ]?

*vt.4* \\
to [ intrude | enter ] uninvited \\
to intrude on without [ warrant || invitation ]
: Don't [ bother ] the professor while she is grading term papers.
: 我们正在捉弄那个总是[ 打搅 ]我的人。>> We are playing a trick on a man who keeps [ bothering ] me.

*vt.5* \\
to [ confuse |  bewilder | perplex ]
: His inability to get the joke [ bothered ] him.

*vt.6* \\
to [ give , cause ] [ discomfort | pain || annoyance || trouble ] to
: His bad leg is [ bothering ] him again.

*vi.1* \\
to take trouble \\
to [ concern || trouble | inconvenience ] oneself

* C
** canonical

*adj.1* \\
[ recognized | established | accepted | orthodox ] \\
accepted as being [ accurate || authoritative ]
: a set of [ canonical ] studies
: the [ canonical ] method of comparative linguistics

** catalyze

*vt.1* \\
to [ cause || accelerate ] (a reaction) by acting as a catalyst \\
to modify, esp. to increase, the rate of (a chemical reaction) by catalysis

*vt.2* \\
to [ bring about | initiate ] \\
to cause (a [ action | process ]) to begin
: The tragic event helped to [ catalyze ] the already growing popular anger.
: The technology bred of science has [ catalyzed ] stupendous economic growth.

*vt.3* \\
to transform \\
to produce fundamental change in
: changes in student enrollment that have [ catalyzed ] the educational system
** claim

*vt.1* \\
to [ demand | ask for ] \\
to assert one's [ title || right ] to \\
(as one's [ due || property || right ])
: to [ claim ] an estate by inheritance
: She's [ claiming ] unemployment benefit.
: You must [ claim ] your money back if the goods are damaged.
: Mr. Smith [ claims ] special tax exemptions because he is a foreign resident.
: 他创造了纪录。>> He [ claimed ] the record.
: 现在他们回来[ 索要 ]原本属于他们的东西。>> Now they are returning to [ claim ] what was theirs.
: 工会[ 要求 ]增长 4 倍于通货膨胀率的工资。>> The union [ claimed ] a raise worth four times the rate of inflation.
: 大约 25% 有资格[ 索赔 ]的人没有那样做。>> Some 25 percent of the people who are entitled to [ claim ] benefits do not do so.

*vt.2* \\
to [ pick up | collect ]
: to [ claim ] one's luggage at the airport carousel
: He [ claimed ] his suitcases at the airline counter.

*vt.3* \\
to [ assert | maintain | affirm ] \\
to assert as a fact \\
to maintain against denial \\
to state to be [ true || existing ] \\
(esp. when open to question)
: a candidate [ claiming ] many supporters
: He [ claimed ] to be telling the truth.
: He [ claimed ] that he killed the burglar.
: 他[ 声称 ]这完全是一个针对他的阴谋。>> He [ claimed ] that it was all a conspiracy against him.
: 一个[ 自称 ]是记者的男人威胁要公开她的私生活细节。>> A man [ claiming ] to be a journalist threatened to reveal details about her private life.

*vt.4* \\
to [ deserve | require | need ] \\
to call for \\
problem =+= \\
=+= attention
: to [ claim ] respect
: This problem [ claims ] our attention.
: 已经有太多人需要她的关注了。>> There is already a long list of people [ claiming ] her attention.

*vt.5* \\
to take \\
(in a violent manner as if by right) \\
(as an undesirable consequence of some [ event , state of affairs ]) \\
accident =+=
: a hurricane that [ claimed ] two lives
: The accident [ claimed ] four lives.
: 昨天内战[ 夺走 ]了一位联合国译员的生命。>> The civil war [ claimed ] the life of a U.N. interpreter yesterday.

** coming

*adj.1* \\
[ next | following | approaching | upcoming | forthcoming | impending ] \\
of the relatively near future \\
(of [ time , event ]) \\
=+= season, year
: this [ coming ] Thursday
: 这明显取决于[ 接下来 ]几个月的天气。>> This obviously depends on the weather in the [ coming ] months.

*adj.2* \\
promising \\
showing promise of [ fame || success ] \\
=+= actor
: He is widely regarded as the [ coming ] man of Scottish rugby.

*adj.3* \\
of future importance
: This is the [ coming ] thing.

** compelling

*adj.1* \\
[ convincing | persuasive ] \\
inspiring conviction \\
not able to be refuted \\
=+= evidence, argument
: The closer you look at the data, the less [ compelling ] it is.
: This isn't a [ compelling ] argument for the reason given above.

** conceivable

*adj.1* \\
[ imaginable | possible ] \\
capable of being [ imagine | conceive | grasp | understand ]d mentally
: A mass uprising was entirely [ conceivable ].

