general/english/en_vocab.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> bother</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>vt.1</b> <br  />
to [ trouble | annoy | disturb | pester | irritate ] <br  />
to cause to be irritated <br  />
to trouble the [ nerves , peace of mind ] of <br  />
(esp. by minor irritations) <br  />
(esp. by repeated [ vexation | act ]s) <br  />
noise <code>+</code>
</p>
<pre class="example">
Stop [ bothering ] your father!
Mosquitoes buzzing in my ear really [ bothers ] me.
I don't know why he [ bothers ] me with this kind of rubbish.
</pre>

<p>
<b>vt.2</b> <br  />
to [ upset | worry | distress || alarm ] <br  />
to make [ nervous || agitated ] <br  />
thought <code>+</code>
</p>
<pre class="example">
That kind of jealousy doesn't [ bother ] me.
The thought of her husband's return clearly [ bothered ] her.
The mere thought of her [ bothered ] him and made his heart beat faster.
有什么事让你[ 烦恼 ]吗？&gt;&gt; Is something [ bothering ] you?
让我[ 烦恼 ]的是，男孩们对我不感兴趣。&gt;&gt; It [ bothered ] me that boys weren't interested in me.
</pre>

<p>
<b>vt.3</b> <br  />
<b>to take the [ time , trouble ] (to do sth.)</b> <br  />
<b>to concern oneself with (accomplishing sth.)</b> <br  />
</p>
<pre class="example">
Don't [ bother ] to come with me.
Most of the papers didn't even [ bother ] reporting it.
很多人如今不[ 费心 ]举办婚礼了。&gt;&gt; Lots of people don't [ bother ] to go through a marriage ceremony these days.
不管我做什么都没有区别，那为什么还要[ 费心 ]去做呢？&gt;&gt; Nothing I do makes any difference anyway, so why [ bother ]?
</pre>

<p>
<b>vt.4</b> <br  />
to [ intrude | enter ] uninvited <br  />
to intrude on without [ warrant || invitation ]
</p>
<pre class="example">
Don't [ bother ] the professor while she is grading term papers.
我们正在捉弄那个总是[ 打搅 ]我的人。&gt;&gt; We are playing a trick on a man who keeps [ bothering ] me.
</pre>

<p>
<b>vt.5</b> <br  />
to [ confuse |  bewilder | perplex ]
</p>
<pre class="example">
His inability to get the joke [ bothered ] him.
</pre>

<p>
<b>vt.6</b> <br  />
to [ give , cause ] [ discomfort | pain || annoyance || trouble ] to
</p>
<pre class="example">
His bad leg is [ bothering ] him again.
</pre>

<p>
<b>vi.1</b> <br  />
to take trouble <br  />
to [ concern || trouble | inconvenience ] oneself
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> C</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> canonical</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>adj.1</b> <br  />
[ recognized | established | accepted | orthodox ] <br  />
accepted as being [ accurate || authoritative ]
</p>
<pre class="example">
a set of [ canonical ] studies
the [ canonical ] method of comparative linguistics
</pre>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> catalyze</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>vt.1</b> <br  />
to [ cause || accelerate ] (a reaction) by acting as a catalyst <br  />
to modify, esp. to increase, the rate of (a chemical reaction) by catalysis
</p>

<p>
<b>vt.2</b> <br  />
to [ bring about | initiate ] <br  />
to cause (a [ action | process ]) to begin
</p>
<pre class="example">
The tragic event helped to [ catalyze ] the already growing popular anger.
The technology bred of science has [ catalyzed ] stupendous economic growth.
</pre>

<p>
<b>vt.3</b> <br  />
to transform <br  />
to produce fundamental change in
</p>
<pre class="example">
changes in student enrollment that have [ catalyzed ] the educational system
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> claim</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>vt.1</b> <br  />
to [ demand | ask for ] <br  />
to assert one's [ title || right ] to <br  />
(as one's [ due || property || right ])
</p>
<pre class="example">
to [ claim ] an estate by inheritance
She's [ claiming ] unemployment benefit.
You must [ claim ] your money back if the goods are damaged.
Mr. Smith [ claims ] special tax exemptions because he is a foreign resident.
他创造了纪录。&gt;&gt; He [ claimed ] the record.
现在他们回来[ 索要 ]原本属于他们的东西。&gt;&gt; Now they are returning to [ claim ] what was theirs.
工会[ 要求 ]增长 4 倍于通货膨胀率的工资。&gt;&gt; The union [ claimed ] a raise worth four times the rate of inflation.
大约 25% 有资格[ 索赔 ]的人没有那样做。&gt;&gt; Some 25 percent of the people who are entitled to [ claim ] benefits do not do so.
</pre>

<p>
<b>vt.2</b> <br  />
to [ pick up | collect ]
</p>
<pre class="example">
to [ claim ] one's luggage at the airport carousel
He [ claimed ] his suitcases at the airline counter.
</pre>

<p>
<b>vt.3</b> <br  />
to [ assert | maintain | affirm ] <br  />
to assert as a fact <br  />
to maintain against denial <br  />
to state to be [ true || existing ] <br  />
(esp. when open to question)
</p>
<pre class="example">
a candidate [ claiming ] many supporters
He [ claimed ] to be telling the truth.
He [ claimed ] that he killed the burglar.
他[ 声称 ]这完全是一个针对他的阴谋。&gt;&gt; He [ claimed ] that it was all a conspiracy against him.
一个[ 自称 ]是记者的男人威胁要公开她的私生活细节。&gt;&gt; A man [ claiming ] to be a journalist threatened to reveal details about her private life.
</pre>

<p>
<b>vt.4</b> <br  />
to [ deserve | require | need ] <br  />
to call for <br  />
problem <code>+</code> <br  />
<code>+</code> attention
</p>
<pre class="example">
to [ claim ] respect
This problem [ claims ] our attention.
已经有太多人需要她的关注了。&gt;&gt; There is already a long list of people [ claiming ] her attention.
</pre>

<p>
<b>vt.5</b> <br  />
to take <br  />
(in a violent manner as if by right) <br  />
(as an undesirable consequence of some [ event , state of affairs ]) <br  />
accident <code>+</code>
</p>
<pre class="example">
a hurricane that [ claimed ] two lives
The accident [ claimed ] four lives.
昨天内战[ 夺走 ]了一位联合国译员的生命。&gt;&gt; The civil war [ claimed ] the life of a U.N. interpreter yesterday.
</pre>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> coming</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<b>adj.1</b> <br  />
[ next | following | approaching | upcoming | forthcoming | impending ] <br  />
of the relatively near future <br  />
(of [ time , event ]) <br  />
<code>+</code> season, year
</p>
<pre class="example">
this [ coming ] Thursday
这明显取决于[ 接下来 ]几个月的天气。&gt;&gt; This obviously depends on the weather in the [ coming ] months.
</pre>

<p>
<b>adj.2</b> <br  />
promising <br  />
showing promise of [ fame || success ] <br  />
<code>+</code> actor
</p>
<pre class="example">
He is widely regarded as the [ coming ] man of Scottish rugby.
</pre>

<p>
<b>adj.3</b> <br  />
of future importance
</p>
<pre class="example">
This is the [ coming ] thing.
</pre>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> compelling</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<b>adj.1</b> <br  />
[ convincing | persuasive ] <br  />
inspiring conviction <br  />
not able to be refuted <br  />
<code>+</code> evidence, argument
</p>
<pre class="example">
The closer you look at the data, the less [ compelling ] it is.
This isn't a [ compelling ] argument for the reason given above.
</pre>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> conceivable</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<b>adj.1</b> <br  />
[ imaginable | possible ] <br  />
capable of being [ imagine | conceive | grasp | understand ]d mentally
</p>
<pre class="example">
A mass uprising was entirely [ conceivable ].
</pre>
</div>
</div>
