general/english/en_vocab.org
** conceive

*vt.1* \\
to devise \\
to [ form | develop ] in the mind \\
=+= plan, idea, opinion
: [ 构思 ]一个增加利润的计划 >> to [ conceive ] a plan to increase profits
: 他在度假时[ 想出 ]了这个项目。>> He [ conceived ] the project while on vacation.
: 她已经[ 想出 ]了一系列小说的主意。>> She had [ conceived ] the idea of a series of novels.
: 他[ 构想出 ]了一个能帮助瘫痪病人的机器人。>> He [ conceived ] of a robot that would help paralyzed patients.

*vt.2* \\
to [ imagine | visualize | have an idea of ] \\
to form a [ notion | idea ] of
: 我[ 想不通 ]你为什么这么做。>> I can't [ conceive ] why you did that.
: 我简直无法[ 想像 ]那样一笔数量的钱。>> I just can't even [ conceive ] of that quantity of money.
: 我们无法[ 相信 ]他可能很快就会死去。>> We could not [ conceive ] that he might soon be dead.
: 如今我们无法[ 想象 ]一个没有电的世界。>> We now cannot [ conceive ] of a world without electricity.
: 你能想象在公共场合（出现）这样的行为吗？>> Would you ever have [ conceived ] such behavior in public?
: 我[ 想不通 ]你为什么会让你的女儿独自外出旅游。>> I can't [ conceive ] why you allowed your daughter to travel alone.

*vt.3* \\
to [ consider | think | believe ] \\
to [ judge | regard ] \\
to hold as an opinion \\
to be of the opinion that
: 古人[ 认为 ]地球漂浮在水里。>> The ancients [ conceived ] the earth as afloat in water.
: 种族主义者[ 认为 ]这些人是劣等的。>> The racist [ conceives ] such people to be inferior.
: 他们不曾[ 认为 ]会发生这样的悲剧。They didn't [ conceive ] that such a tragedy could occur.
: 我们[ 认为 ]家庭是处于不断变化之中的。>> We [ conceive ] of the family as being in a constant state of change.

*vt.4* \\
to [ understand | grasp ] \\
to apprehend mentally \\
to [ perceive || recognize ] the meaning of
: 我无法[ 理解 ]这句话的意思。>> I couldn't [ conceive ] the meaning of that sentence.

*vt.5* \\
to [ experience || form ] a feeling \\
怀有
: 对某人抱有成见 >> to conceive a prejudice against someone
: 她对音乐怀有激情。>> She [ conceived ] a passion for music.

*vt.6* \\
to become pregnant with (offspring)
: 她在伦敦[ 怀上 ]的第一个孩子。>> She [ conceived ] her first child in London.
: 女人在计划[ 怀孕 ]前应该戒酒。>> Women should give up alcohol before they plan to [ conceive ].

** contemplate

*vt.1* \\
to [ ponder | meditate on | reflect upon ] \\
to [ think about | consider ] [ intently | carefully || at length | thoroughly | deeply ] \\
(as for spiritual purposes)
: [ contemplated ] the mysteries of the atom
: [ contemplated ] the problem from all sides
: She [ contemplated ] her future gloomily.
: 那天晚上他躺在医院病床上，当他反复[ 思考 ]自己的未来时他哭了。>> As he lay in his hospital bed that night, he cried as he [ contemplated ] his future.

*vt.2* \\
to [ plan | intend ] \\
to have in view as a future event \\
to [ have in mind | consider ] as a [ intention | purpost | goal , possibility ]
: to [ contemplate ] marriage
: to [ contemplate ] changing jobs
: to [ contemplate ] buying a new car
: forced by the accident to [ contemplate ] retirement
: I [ contemplated ] leaving school and taking a full-time job.
: 他曾一度[ 考虑 ]做一名军医。>> For a time he [ contemplated ] a career as an army medical doctor.

*vt.3* \\
to direct the eyes on an object \\
to [ look at | view | observe | inspect ] [ thoughtfully | pensively , attentively | with continued attention ]
: The little boy stood [ contemplating ] himself in the mirror.
: 他[ 凝视 ]着他的双手，依然皱着眉头。>> He [ contemplated ] his hands, still frowning.

** contextual

*adj.1* \\
[ of , involving , depending on | determined by | relating to ] a context
: [ contextual ] information
: [ contextual ] criticism of a book
: lessons for all of us in this ever-changing, [ ever-contextual ] new world

** convenient

*adj.1* \\
[ suitable | fitting | satisfactory | opportune ] \\
well-suited with respect to [ facility , ease in use ] \\
[ suitable | suited | favorable | agreeable ] to one's [ comfort || purpose || need ]
: at a [ convenient ] moment
: a [ convenient ] excuse for not going
: a [ convenient ] time to receive guests
: Her death was certainly [ convenient ] for him.
: The family found it more [ convenient ] to eat in the kitchen.
: 她会尽量把面谈安排在一个双方都[ 方便的 ]时间和地点。>> She will try to arrange a mutually [ convenient ] time and place for an interview.

*adj.2* \\
[ useful | practical | handy ]
: Pre-prepared foods are a tempting and [ convenient ] option.
: 一种灵活[ 方便的 ]支付商务费用的方式 >> a flexible and [ convenient ] way of paying for business expenses

*adj.3* \\
[ nearby | close by | within reach | accessible ] \\
close at hand \\
easy to reach
: [ convenient ] to all transportation
: a bank with branches at six [ convenient ] locations
: an apartment that is [ convenient ] to shopping and transportation
: He put it on a [ convenient ] chair.
: The town is [ convenient ] for Heathrow Airport.

** conversely

*adv.1* \\
on the other hand \\
in a [ contrary | opposite ] way \\
with the terms of the relation reversed \\
introducing a [ statement || idea ] that reverses one that has just been [ make , refer to ]d
: [ Conversely ], not all women are mothers.
: He would have preferred his wife not to work, although [ conversely ] he was also proud of what she did.
** conversion

*n.1* \\
transition \\
the [ act || process ] of converting \\
an event that results in a transformation \\
a [ change | adaptation ] in [ form || character || function ]
: 把废弃的铁路改[ 变成 ]自行车道 >> the [ conversion ] of disused rail lines into cycle routes

*n.2* \\
the state of being converted \\
sth. changed in [ form || character || function ] \\
sth. that is changed from one [ use | function | purpose ] to another

*n.3* \\
a change in which one adopts a new [ religion | faith | belief ] \\
change from one [ religion || political belief || viewpoint || course ] to another
: his [ conversion ] to Christianity

*n.4* \\
a change in the [ unit , form ] of an expression
: [ conversion ] from Fahrenheit to Centigrade

*n.5* \\
a physical transformation from one [ material || state ] to another
: [ conversion ] of base metals into gold

** costly

*adj.1* \\
expensive \\
costing much \\
of high [ price | cost || value ]
: [ costly ] jewelry
: 买专业制造的窗帘可能很[ 贵 ]。>> Having professionally made curtains can be [ costly ].

*adj.2* \\
[ damaging | harmful ] \\
entailing [ loss || sacrifice ] \\
resulting in great detriment \\
=+= mistake, war, victory
: An indiscreet remark triggered off a long and [ costly ] strike.
: This sort of scandal in international banking has been politically [ costly ].

*adj.3* \\
[ splendid | gorgeous | lavish ] \\
involving great expense
: the exceptionally beautiful and [ costly ] cloths made in northern Italy

