general/english/en_vocab.html
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> conceive</h3>
<div class="outline-text-3" id="text-3-7">
<p>
<b>vt.1</b> <br  />
to devise <br  />
to [ form | develop ] in the mind <br  />
<code>+</code> plan, idea, opinion
</p>
<pre class="example">
[ 构思 ]一个增加利润的计划 &gt;&gt; to [ conceive ] a plan to increase profits
他在度假时[ 想出 ]了这个项目。&gt;&gt; He [ conceived ] the project while on vacation.
她已经[ 想出 ]了一系列小说的主意。&gt;&gt; She had [ conceived ] the idea of a series of novels.
他[ 构想出 ]了一个能帮助瘫痪病人的机器人。&gt;&gt; He [ conceived ] of a robot that would help paralyzed patients.
</pre>

<p>
<b>vt.2</b> <br  />
to [ imagine | visualize | have an idea of ] <br  />
to form a [ notion | idea ] of
</p>
<pre class="example">
我[ 想不通 ]你为什么这么做。&gt;&gt; I can't [ conceive ] why you did that.
我简直无法[ 想像 ]那样一笔数量的钱。&gt;&gt; I just can't even [ conceive ] of that quantity of money.
我们无法[ 相信 ]他可能很快就会死去。&gt;&gt; We could not [ conceive ] that he might soon be dead.
如今我们无法[ 想象 ]一个没有电的世界。&gt;&gt; We now cannot [ conceive ] of a world without electricity.
你能想象在公共场合（出现）这样的行为吗？&gt;&gt; Would you ever have [ conceived ] such behavior in public?
我[ 想不通 ]你为什么会让你的女儿独自外出旅游。&gt;&gt; I can't [ conceive ] why you allowed your daughter to travel alone.
</pre>

<p>
<b>vt.3</b> <br  />
to [ consider | think | believe ] <br  />
to [ judge | regard ] <br  />
to hold as an opinion <br  />
to be of the opinion that
</p>
<pre class="example">
古人[ 认为 ]地球漂浮在水里。&gt;&gt; The ancients [ conceived ] the earth as afloat in water.
种族主义者[ 认为 ]这些人是劣等的。&gt;&gt; The racist [ conceives ] such people to be inferior.
他们不曾[ 认为 ]会发生这样的悲剧。They didn't [ conceive ] that such a tragedy could occur.
我们[ 认为 ]家庭是处于不断变化之中的。&gt;&gt; We [ conceive ] of the family as being in a constant state of change.
</pre>

<p>
<b>vt.4</b> <br  />
to [ understand | grasp ] <br  />
to apprehend mentally <br  />
to [ perceive || recognize ] the meaning of
</p>
<pre class="example">
我无法[ 理解 ]这句话的意思。&gt;&gt; I couldn't [ conceive ] the meaning of that sentence.
</pre>

<p>
<b>vt.5</b> <br  />
to [ experience || form ] a feeling <br  />
怀有
</p>
<pre class="example">
对某人抱有成见 &gt;&gt; to conceive a prejudice against someone
她对音乐怀有激情。&gt;&gt; She [ conceived ] a passion for music.
</pre>

<p>
<b>vt.6</b> <br  />
to become pregnant with (offspring)
</p>
<pre class="example">
她在伦敦[ 怀上 ]的第一个孩子。&gt;&gt; She [ conceived ] her first child in London.
女人在计划[ 怀孕 ]前应该戒酒。&gt;&gt; Women should give up alcohol before they plan to [ conceive ].
</pre>
</div>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> contemplate</h3>
<div class="outline-text-3" id="text-3-8">
<p>
<b>vt.1</b> <br  />
to [ ponder | meditate on | reflect upon ] <br  />
to [ think about | consider ] [ intently | carefully || at length | thoroughly | deeply ] <br  />
(as for spiritual purposes)
</p>
<pre class="example">
[ contemplated ] the mysteries of the atom
[ contemplated ] the problem from all sides
She [ contemplated ] her future gloomily.
那天晚上他躺在医院病床上，当他反复[ 思考 ]自己的未来时他哭了。&gt;&gt; As he lay in his hospital bed that night, he cried as he [ contemplated ] his future.
</pre>

<p>
<b>vt.2</b> <br  />
to [ plan | intend ] <br  />
to have in view as a future event <br  />
to [ have in mind | consider ] as a [ intention | purpost | goal , possibility ]
</p>
<pre class="example">
to [ contemplate ] marriage
to [ contemplate ] changing jobs
to [ contemplate ] buying a new car
forced by the accident to [ contemplate ] retirement
I [ contemplated ] leaving school and taking a full-time job.
他曾一度[ 考虑 ]做一名军医。&gt;&gt; For a time he [ contemplated ] a career as an army medical doctor.
</pre>

<p>
<b>vt.3</b> <br  />
to direct the eyes on an object <br  />
to [ look at | view | observe | inspect ] [ thoughtfully | pensively , attentively | with continued attention ]
</p>
<pre class="example">
The little boy stood [ contemplating ] himself in the mirror.
他[ 凝视 ]着他的双手，依然皱着眉头。&gt;&gt; He [ contemplated ] his hands, still frowning.
</pre>
</div>
</div>
<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> contextual</h3>
<div class="outline-text-3" id="text-3-9">
<p>
<b>adj.1</b> <br  />
[ of , involving , depending on | determined by | relating to ] a context
</p>
<pre class="example">
[ contextual ] information
[ contextual ] criticism of a book
lessons for all of us in this ever-changing, [ ever-contextual ] new world
</pre>
</div>
</div>
<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> convenient</h3>
<div class="outline-text-3" id="text-3-10">
<p>
<b>adj.1</b> <br  />
[ suitable | fitting | satisfactory | opportune ] <br  />
well-suited with respect to [ facility , ease in use ] <br  />
[ suitable | suited | favorable | agreeable ] to one's [ comfort || purpose || need ]
</p>
<pre class="example">
at a [ convenient ] moment
a [ convenient ] excuse for not going
a [ convenient ] time to receive guests
Her death was certainly [ convenient ] for him.
The family found it more [ convenient ] to eat in the kitchen.
她会尽量把面谈安排在一个双方都[ 方便的 ]时间和地点。&gt;&gt; She will try to arrange a mutually [ convenient ] time and place for an interview.
</pre>

<p>
<b>adj.2</b> <br  />
[ useful | practical | handy ]
</p>
<pre class="example">
Pre-prepared foods are a tempting and [ convenient ] option.
一种灵活[ 方便的 ]支付商务费用的方式 &gt;&gt; a flexible and [ convenient ] way of paying for business expenses
</pre>

<p>
<b>adj.3</b> <br  />
[ nearby | close by | within reach | accessible ] <br  />
close at hand <br  />
easy to reach
</p>
<pre class="example">
[ convenient ] to all transportation
a bank with branches at six [ convenient ] locations
an apartment that is [ convenient ] to shopping and transportation
He put it on a [ convenient ] chair.
The town is [ convenient ] for Heathrow Airport.
</pre>
</div>
</div>
<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> conversely</h3>
<div class="outline-text-3" id="text-3-11">
<p>
<b>adv.1</b> <br  />
on the other hand <br  />
in a [ contrary | opposite ] way <br  />
with the terms of the relation reversed <br  />
introducing a [ statement || idea ] that reverses one that has just been [ make , refer to ]d
</p>
<pre class="example">
[ Conversely ], not all women are mothers.
He would have preferred his wife not to work, although [ conversely ] he was also proud of what she did.
</pre>
</div>
</div>

<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> conversion</h3>
<div class="outline-text-3" id="text-3-12">
<p>
<b>n.1</b> <br  />
transition <br  />
the [ act || process ] of converting <br  />
an event that results in a transformation <br  />
a [ change | adaptation ] in [ form || character || function ]
</p>
<pre class="example">
把废弃的铁路改[ 变成 ]自行车道 &gt;&gt; the [ conversion ] of disused rail lines into cycle routes
</pre>

<p>
<b>n.2</b> <br  />
the state of being converted <br  />
sth. changed in [ form || character || function ] <br  />
sth. that is changed from one [ use | function | purpose ] to another
</p>

<p>
<b>n.3</b> <br  />
a change in which one adopts a new [ religion | faith | belief ] <br  />
change from one [ religion || political belief || viewpoint || course ] to another
</p>
<pre class="example">
his [ conversion ] to Christianity
</pre>

<p>
<b>n.4</b> <br  />
a change in the [ unit , form ] of an expression
</p>
<pre class="example">
[ conversion ] from Fahrenheit to Centigrade
</pre>

<p>
<b>n.5</b> <br  />
a physical transformation from one [ material || state ] to another
</p>
<pre class="example">
[ conversion ] of base metals into gold
</pre>
</div>
</div>
<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> costly</h3>
<div class="outline-text-3" id="text-3-13">
<p>
<b>adj.1</b> <br  />
expensive <br  />
costing much <br  />
of high [ price | cost || value ]
</p>
<pre class="example">
[ costly ] jewelry
买专业制造的窗帘可能很[ 贵 ]。&gt;&gt; Having professionally made curtains can be [ costly ].
</pre>

<p>
<b>adj.2</b> <br  />
[ damaging | harmful ] <br  />
entailing [ loss || sacrifice ] <br  />
resulting in great detriment <br  />
<code>+</code> mistake, war, victory
</p>
<pre class="example">
An indiscreet remark triggered off a long and [ costly ] strike.
This sort of scandal in international banking has been politically [ costly ].
</pre>

<p>
<b>adj.3</b> <br  />
[ splendid | gorgeous | lavish ] <br  />
involving great expense
</p>
<pre class="example">
the exceptionally beautiful and [ costly ] cloths made in northern Italy
</pre>
</div>
</div>
