general/english/en_vocab.org
** covert

adj.1 \\
[ hidden | concealed || stealthy ] \\
not openly [ acknowledge , display ]ed
: [ covert ] plans to sell arms
: [ covert ] operations against the dictatorship

** credential

*n.1* \\
credentials \\
a document attesting to the truth of certain stated facts \\
evidence of entitlement to [ right | privilege ]s, usually in written form \\
a [ letter , certificate ] giving evidence of the bearer's [ identity , competence ] \\
[ evidence | testimonial ]s concerning one's right to [ credit , confidence , authority ]
: No one admitted without [ credentials ].
: The new ambassador presented her [ credentials ] to the president.

*n.2* \\
anything that provides the basis for [ confidence , belief ] \\
that which entitles one to [ confidence , credit , authority ]

** credit

*n.1* \\
< give credit for > \\
[ recognition | approval | commendation ] for a [ act || ability || quality ]
: She was [ given credit for ] her work.
: He [ gave ] them [ credit for ] a job well done.
: He was [ given credit for ] completing the work so quickly.

*n.2* \\
[ trustworthiness | credibility ] \\
belief in the [ truth || reliability || quality ] of
: I would give credit to that philosophy.

** criterion

*n.1* \\
<pl. criteria> \\
[ standard | benchmark | measure ] \\
a basis for comparison \\
a standard of [ judgment | criticism ] \\
a [ rule | principle ] for [ evaluate | test ]ing sth. \\
a standard by which sth. can be [ judge | decide ]d \\
a means by which individuals are [ compare | judge ]d \\
a reference point against which other things can be evaluated \\
a [ standard | rule || test ] on which a [ judgment | decision ] can be based
: Practice is the sole [ criterion ] of truth.
: Exam results shouldn't be the only [ criterion ] for your choice of school.
: What are your [ criteria ] for deciding which words to include in this dictionary?
: 参加的最重要[ 标准 ]就是申请人必须设计并制作自己的作品。>> The most important [ criterion ] for entry is that applicants must design and make their own work.

* D
** deteriorate

*vt.1* \\
to depreciate \\
to [ diminish | impair ] in [ quality || character || value ] \\
to make [ worse | inferior | lower ] in [ quality || value || character ]
: Time and neglect had [ deteriorated ] the property.

*vi.1* \\
to degenerate \\
to [ grow || become ] worse
: Her condition [ deteriorated ].
: The weather [ deteriorated ] overnight.
: 人们担心局势会[ 恶化 ]为全面战争。>> There are fears that the situation might [ deteriorate ] into full-scale war.

*vi.2* \\
to [ weaken | disintegrate | decay | wear away ]
: The nation's highways are [ deteriorating ] at a rapid pace.

** devise

*vt.1* \\
to [ conceive | design ] \\
to [ plan | invent ] (a complex [ procedure | system | mechanism ]) by careful thought
: a training program should be [ devised ]
: Sales managers have to [ devise ] a marketing plan.
: They have [ devised ] a way to recycle contaminated oil.
: ... to encourage the candidate to engage with the interviewer and [ devise ] a coherent solution.

** dictate

*vt.1* \\
to [ say , read ] aloud to be [ record , write ]d by another \\
to say or read aloud for a person to transcribe or for a machine to record \\
=+= message, letter, speech
: He [ dictates ] his novels to his secretary.

*vt.2* \\
to [ impose | demand | prescribe ] \\
to act in a tyrannical manner \\
to set forth [ expressly , authoritatively ] \\
to seek to impose one's will on others \\
([ officially | with authority | authoritatively ])
: to [ dictate ] the rules of the game
: to [ dictate ] peace terms to the enemy
: He [ dictated ] the terms of our offer.

*vt.3* \\
to [ control | command | order ] \\
to command unconditionally \\
to issue [ command | order]s for \\
(in an arrogant manner)
: I certainly won't be [ dictated ] to by you.
: 是什么给他们权利来[ 规定 ]我们该吃什么？>> What gives them the right to [ dictate ] to us what we should eat?
: 一个国家有什么权利[ 规定 ]另一个国家的环境标准？>> What right has one country to [ dictate ] the environmental standards of another?

*vt.4* \\
to [ influence || cause ]
: Circumstances [ dictated ] that they played a defensive game.
: 该影片的预算[ 决定 ]了紧张的拍摄进度。>> The film's budget [ dictated ] a tough schedule.
: 一棵苹果树能存活多久是由许多因素[ 决定 ]的。>> A number of factors will [ dictate ] how long an apple tree can survive.

** dismay

*n.1* \\
[ agitation | consternation ] \\
utter disheartenment \\
feeling of despair in the face of obstacles \\
fear resulting from the awareness of danger \\
a [ sudden , complete ] loss of courage in the face of [ trouble | danger ]
: The idea fills its critics with [ dismay ].
: They reacted to the news with [ dismay ].
: 当地政客们作出了[ 恐慌 ]和愤慨的反应。>> Local politicians have reacted with [ dismay ] and indignation. 

*n.2* \\
[ disappointment | dissatisfaction ]
: Much to her [ dismay ], he did not call.

