general/english/en_vocab.html
<div id="outline-container-sec-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> covert</h3>
<div class="outline-text-3" id="text-3-14">
<p>
adj.1 <br  />
[ hidden | concealed || stealthy ] <br  />
not openly [ acknowledge , display ]ed
</p>
<pre class="example">
[ covert ] plans to sell arms
[ covert ] operations against the dictatorship
</pre>
</div>
</div>
<div id="outline-container-sec-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> credential</h3>
<div class="outline-text-3" id="text-3-15">
<p>
<b>n.1</b> <br  />
credentials <br  />
a document attesting to the truth of certain stated facts <br  />
evidence of entitlement to [ right | privilege ]s, usually in written form <br  />
a [ letter , certificate ] giving evidence of the bearer's [ identity , competence ] <br  />
[ evidence | testimonial ]s concerning one's right to [ credit , confidence , authority ]
</p>
<pre class="example">
No one admitted without [ credentials ].
The new ambassador presented her [ credentials ] to the president.
</pre>

<p>
<b>n.2</b> <br  />
anything that provides the basis for [ confidence , belief ] <br  />
that which entitles one to [ confidence , credit , authority ]
</p>
</div>
</div>
<div id="outline-container-sec-3-16" class="outline-3">
<h3 id="sec-3-16"><span class="section-number-3">3.16</span> credit</h3>
<div class="outline-text-3" id="text-3-16">
<p>
<b>n.1</b> <br  />
&lt; give credit for &gt; <br  />
[ recognition | approval | commendation ] for a [ act || ability || quality ]
</p>
<pre class="example">
She was [ given credit for ] her work.
He [ gave ] them [ credit for ] a job well done.
He was [ given credit for ] completing the work so quickly.
</pre>

<p>
<b>n.2</b> <br  />
[ trustworthiness | credibility ] <br  />
belief in the [ truth || reliability || quality ] of
</p>
<pre class="example">
I would give credit to that philosophy.
</pre>
</div>
</div>
<div id="outline-container-sec-3-17" class="outline-3">
<h3 id="sec-3-17"><span class="section-number-3">3.17</span> criterion</h3>
<div class="outline-text-3" id="text-3-17">
<p>
<b>n.1</b> <br  />
&lt;pl. criteria&gt; <br  />
[ standard | benchmark | measure ] <br  />
a basis for comparison <br  />
a standard of [ judgment | criticism ] <br  />
a [ rule | principle ] for [ evaluate | test ]ing sth. <br  />
a standard by which sth. can be [ judge | decide ]d <br  />
a means by which individuals are [ compare | judge ]d <br  />
a reference point against which other things can be evaluated <br  />
a [ standard | rule || test ] on which a [ judgment | decision ] can be based
</p>
<pre class="example">
Practice is the sole [ criterion ] of truth.
Exam results shouldn't be the only [ criterion ] for your choice of school.
What are your [ criteria ] for deciding which words to include in this dictionary?
参加的最重要[ 标准 ]就是申请人必须设计并制作自己的作品。&gt;&gt; The most important [ criterion ] for entry is that applicants must design and make their own work.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> D</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> deteriorate</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>vt.1</b> <br  />
to depreciate <br  />
to [ diminish | impair ] in [ quality || character || value ] <br  />
to make [ worse | inferior | lower ] in [ quality || value || character ]
</p>
<pre class="example">
Time and neglect had [ deteriorated ] the property.
</pre>

<p>
<b>vi.1</b> <br  />
to degenerate <br  />
to [ grow || become ] worse
</p>
<pre class="example">
Her condition [ deteriorated ].
The weather [ deteriorated ] overnight.
人们担心局势会[ 恶化 ]为全面战争。&gt;&gt; There are fears that the situation might [ deteriorate ] into full-scale war.
</pre>

<p>
<b>vi.2</b> <br  />
to [ weaken | disintegrate | decay | wear away ]
</p>
<pre class="example">
The nation's highways are [ deteriorating ] at a rapid pace.
</pre>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> devise</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>vt.1</b> <br  />
to [ conceive | design ] <br  />
to [ plan | invent ] (a complex [ procedure | system | mechanism ]) by careful thought
</p>
<pre class="example">
a training program should be [ devised ]
Sales managers have to [ devise ] a marketing plan.
They have [ devised ] a way to recycle contaminated oil.
... to encourage the candidate to engage with the interviewer and [ devise ] a coherent solution.
</pre>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> dictate</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>vt.1</b> <br  />
to [ say , read ] aloud to be [ record , write ]d by another <br  />
to say or read aloud for a person to transcribe or for a machine to record <br  />
<code>+</code> message, letter, speech
</p>
<pre class="example">
He [ dictates ] his novels to his secretary.
</pre>

<p>
<b>vt.2</b> <br  />
to [ impose | demand | prescribe ] <br  />
to act in a tyrannical manner <br  />
to set forth [ expressly , authoritatively ] <br  />
to seek to impose one's will on others <br  />
([ officially | with authority | authoritatively ])
</p>
<pre class="example">
to [ dictate ] the rules of the game
to [ dictate ] peace terms to the enemy
He [ dictated ] the terms of our offer.
</pre>

<p>
<b>vt.3</b> <br  />
to [ control | command | order ] <br  />
to command unconditionally <br  />
to issue [ command | order]s for <br  />
(in an arrogant manner)
</p>
<pre class="example">
I certainly won't be [ dictated ] to by you.
是什么给他们权利来[ 规定 ]我们该吃什么？&gt;&gt; What gives them the right to [ dictate ] to us what we should eat?
一个国家有什么权利[ 规定 ]另一个国家的环境标准？&gt;&gt; What right has one country to [ dictate ] the environmental standards of another?
</pre>

<p>
<b>vt.4</b> <br  />
to [ influence || cause ]
</p>
<pre class="example">
Circumstances [ dictated ] that they played a defensive game.
该影片的预算[ 决定 ]了紧张的拍摄进度。&gt;&gt; The film's budget [ dictated ] a tough schedule.
一棵苹果树能存活多久是由许多因素[ 决定 ]的。&gt;&gt; A number of factors will [ dictate ] how long an apple tree can survive.
</pre>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> dismay</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<b>n.1</b> <br  />
[ agitation | consternation ] <br  />
utter disheartenment <br  />
feeling of despair in the face of obstacles <br  />
fear resulting from the awareness of danger <br  />
a [ sudden , complete ] loss of courage in the face of [ trouble | danger ]
</p>
<pre class="example">
The idea fills its critics with [ dismay ].
They reacted to the news with [ dismay ].
当地政客们作出了[ 恐慌 ]和愤慨的反应。&gt;&gt; Local politicians have reacted with [ dismay ] and indignation. 
</pre>

<p>
<b>n.2</b> <br  />
[ disappointment | dissatisfaction ]
</p>
<pre class="example">
Much to her [ dismay ], he did not call.
</pre>
</div>
</div>
