general/english/en_vocab.org
** dispatch

*vt.1* \\
to send on specific business \\
to relegate to a specific destination \\
to send away towards a designated goal \\
to send off promptly (as to [ a destination , perform a task ]) \\
=+= messenger, telegram
: He [ dispatched ] several letters asking for financial help.
: 他一直不断地[ 派遣 ]侦察员到前面去。>> He had been continually [ dispatching ] scouts ahead.
: 胜利鼓舞了他[ 发 ]喜电给罗斯福。>> The victory inspired him to [ dispatch ] a gleeful telegram to Roosevelt.

*vt.2* \\
to [ complete | discharge | transact | dispose of ] [ promptly | speedily | efficiently ] \\
=+= task, errand
: He [ dispatched ] the task he was assigned.
: She [ dispatched ] several pieces of business within the hour.

*vt.3* \\
to send an important official message sent by a [ diplomat || military officer ] with promptness

*vt.4* \\
to [ kill | murder | execute ] \\
to put to death summarily \\
(intentionally and with premeditation)
: The traitor was [ dispatched ] by the conspirators.
: They may catch him and [ dispatch ] him immediately.

*n.1* \\
the act of sending off a [ letter , messenger ]
: The parcel is ready for [ dispatch ].
: [ 派遣 ]特遣队纯粹是应急措施。>> The [ dispatch ] of the task force is purely a contingency measure.

*n.2* \\
an official [ communication | report | message ] sent [ quickly | in haste | with speed ]
: This [ dispatch ] from our West Africa correspondent.

*n.3* \\
<in dispatch> \\
<with dispatch> \\
[ prompt | speedy ] action \\
rapidness of [ movement || activity ] \\
speed in [ performance , movement ] \\
the property of being [ prompt || efficient ]
: We should act [ with dispatch ].

*n.4* \\
[ murder | execution ] \\
the act of putting to death

** drain

*vt.1* \\
to empty (by drawing off liquid) \\
to cause liquid to go out from \\
=+= pond, bathtub, vegetable

*vt.2* \\
to [ draw off | remove ] liquid from \\
to draw off (a liquid) [ gradually , by a gradual process ] \\
to drain water from the (sink, vegetable)

*vt.3* \\
to drink the entire contents of \\
=+= cup, glass

*vt.4* \\
to [ sap | exhaust ] \\
to deplete gradually, esp. to the point of complete exhaustion \\
to [ consume , make constant demands ] on [ resource || energy ]

*vt.5* \\
to exhaust the [ strength || resource ] of \\
to [ fatigue || spend ] [ emotionally || physically ]
: The day's events completely [ drained ] me of all strength.

*vi.1* \\
to [ flow off | flow out ]
: Gasoline [ drained ] slowly from the tilted can.

*vi.2* \\
to become empty by the drawing off of liquid
: watched the tub slowly [ drain ]

*vi.3* \\
to dwindle \\
to become gradually depleted
: felt his enthusiasm [ draining ]

*n.1* \\
[ depletion | consumption ] \\
a gradual [ outflow | loss ]

*n.2* \\
sth. that causes a gradual loss \\
sth. that causes a large [ outflow | depletion ] \\
sth. consuming resources and providing nothing in return \\
an [ instance | cause ] of continuous diminution in [ resource || energy ]
: That rental property is a [ drain ] on our finances.

** dwell

*vt.1* \\
< dwell on > \\
to overthink \\
to [ think , speak , write ] at length about a particular subject \\
(esp. one that is a source of [ unhappiness || anxiety || dissatisfaction ])
: I've got better things to do than [ dwell on ] the past.

* E
** emerge

*v.1* \\
to rise from [ water | liquid ] \\
to rise (as if) from immersion \\
to come up to the surface of [ water | liquid ] \\
to [ move out , move away ] from a surrounding [ fluid , covering | shelter ]
: animals [ emerging ] from the forest
: Sea mammals must [ emerge ] periodically to breathe.

*v.2* \\
to come forth into view \\
(as from [ concealment || obscurity ])
: The house [ emerged ] in the fog.
: 当她[ 出现 ]的时候，理查德正等候在门外。>> Richard was waiting outside the door as she [ emerged ].
: 她从法院大楼[ 出来 ]向支持者们表示感谢。>> She [ emerged ] from the courthouse to thank her supporters.

*v.3* \\
to [ arise | turn up | come to light ] \\
to become [ evident | apparent || known || prominent ] \\
(after being in obscurity) \\
truth, evidence =+=
: new leaders who may [ emerge ]
: evidence that [ emerged ] from the investigation
: The truth [ emerged ] at the inquest.
: Some nice results [ emerged ] from the study.
: Several interesting things [ emerged ] from the report.
: 过去几年中[ 暴露 ]出来的日趋严重的腐败 >> the growing corruption that has [ emerged ] in the past few years
: 很快[ 显示 ]的是 7 月和 8 月的抵押款都没有被收取。>> It soon [ emerged ] that neither the July nor August mortgage payment had been collected.

*v.4* \\
to [ appear | come into existence || develop ]
: a period when many new life forms [ emerged ]
: 1917 年 10 月[ 成立 ]的新共和国 >> the new republic that [ emerged ] in October 1917

** employ

*vt.1* \\
to hire \\
to have on the payroll \\
to provide work to sb. for pay \\
to [ engage , make use of ] the services of a person in return for money
: agreed to [ employ ] the job applicant
: 该公司[ 雇用 ]18位职工。>> The company [ employs ] 18 staff.
: 超过3000名本地工人受[ 雇 ]于旅游业。>> More than 3,000 local workers are [ employed ] in the tourism industry.

*vt.2* \\
to [ use | apply | utilize | make use of ] \\
to use as a means \\
to put sth. into [ use , service ] \\
( for a specific task ) \\
=+= method, measure, approach, tactic, skill
: [ employed ] her skills in the new job
: [ employed ] computers to solve the problem
: to [ employ ] secret measures to get one's ends
: the approaches and methods we [ employed ] in this study
: 该团体将[ 运用 ]混合策略来实现其目标。>> The group will [ employ ] a mix of tactics to achieve its aim.

*vt.3* \\
to [ occupy | keep busy ] \\
to occupy the [ time || attention ] \\
to engage the [ attention , activity ] of
: [ employed ] himself for an hour reading blogs
: She was busily [ employed ] (in) writing letters.

*vt.4* \\
to spend \\
to devote [ time || energy ] to a particular [ activity || purpose ]
: [ employed ] several months in learning Swahili
: Collecting stamps [ employs ] a lot of his time.
: 你的时间可以被有效地[ 利用 ]来上夜课。>> Your time could be usefully [ employed ] in attending night classes.

*vt.5* \\
<in the employ of> \\
<in sb.'s employ> \\
[ hire | employ | engage ]d by \\
in the service of
: They hinted that he was [ in the employ of ] the KGB.

