general/english/en_vocab.html
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> dispatch</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<b>vt.1</b> <br  />
to send on specific business <br  />
to relegate to a specific destination <br  />
to send away towards a designated goal <br  />
to send off promptly (as to [ a destination , perform a task ]) <br  />
<code>+</code> messenger, telegram
</p>
<pre class="example">
He [ dispatched ] several letters asking for financial help.
他一直不断地[ 派遣 ]侦察员到前面去。&gt;&gt; He had been continually [ dispatching ] scouts ahead.
胜利鼓舞了他[ 发 ]喜电给罗斯福。&gt;&gt; The victory inspired him to [ dispatch ] a gleeful telegram to Roosevelt.
</pre>

<p>
<b>vt.2</b> <br  />
to [ complete | discharge | transact | dispose of ] [ promptly | speedily | efficiently ] <br  />
<code>+</code> task, errand
</p>
<pre class="example">
He [ dispatched ] the task he was assigned.
She [ dispatched ] several pieces of business within the hour.
</pre>

<p>
<b>vt.3</b> <br  />
to send an important official message sent by a [ diplomat || military officer ] with promptness
</p>

<p>
<b>vt.4</b> <br  />
to [ kill | murder | execute ] <br  />
to put to death summarily <br  />
(intentionally and with premeditation)
</p>
<pre class="example">
The traitor was [ dispatched ] by the conspirators.
They may catch him and [ dispatch ] him immediately.
</pre>

<p>
<b>n.1</b> <br  />
the act of sending off a [ letter , messenger ]
</p>
<pre class="example">
The parcel is ready for [ dispatch ].
[ 派遣 ]特遣队纯粹是应急措施。&gt;&gt; The [ dispatch ] of the task force is purely a contingency measure.
</pre>

<p>
<b>n.2</b> <br  />
an official [ communication | report | message ] sent [ quickly | in haste | with speed ]
</p>
<pre class="example">
This [ dispatch ] from our West Africa correspondent.
</pre>

<p>
<b>n.3</b> <br  />
&lt;in dispatch&gt; <br  />
&lt;with dispatch&gt; <br  />
[ prompt | speedy ] action <br  />
rapidness of [ movement || activity ] <br  />
speed in [ performance , movement ] <br  />
the property of being [ prompt || efficient ]
</p>
<pre class="example">
We should act [ with dispatch ].
</pre>

<p>
<b>n.4</b> <br  />
[ murder | execution ] <br  />
the act of putting to death
</p>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> drain</h3>
<div class="outline-text-3" id="text-4-6">
<p>
<b>vt.1</b> <br  />
to empty (by drawing off liquid) <br  />
to cause liquid to go out from <br  />
<code>+</code> pond, bathtub, vegetable
</p>

<p>
<b>vt.2</b> <br  />
to [ draw off | remove ] liquid from <br  />
to draw off (a liquid) [ gradually , by a gradual process ] <br  />
to drain water from the (sink, vegetable)
</p>

<p>
<b>vt.3</b> <br  />
to drink the entire contents of <br  />
<code>+</code> cup, glass
</p>

<p>
<b>vt.4</b> <br  />
to [ sap | exhaust ] <br  />
to deplete gradually, esp. to the point of complete exhaustion <br  />
to [ consume , make constant demands ] on [ resource || energy ]
</p>

<p>
<b>vt.5</b> <br  />
to exhaust the [ strength || resource ] of <br  />
to [ fatigue || spend ] [ emotionally || physically ]
</p>
<pre class="example">
The day's events completely [ drained ] me of all strength.
</pre>

<p>
<b>vi.1</b> <br  />
to [ flow off | flow out ]
</p>
<pre class="example">
Gasoline [ drained ] slowly from the tilted can.
</pre>

<p>
<b>vi.2</b> <br  />
to become empty by the drawing off of liquid
</p>
<pre class="example">
watched the tub slowly [ drain ]
</pre>

<p>
<b>vi.3</b> <br  />
to dwindle <br  />
to become gradually depleted
</p>
<pre class="example">
felt his enthusiasm [ draining ]
</pre>

<p>
<b>n.1</b> <br  />
[ depletion | consumption ] <br  />
a gradual [ outflow | loss ]
</p>

<p>
<b>n.2</b> <br  />
sth. that causes a gradual loss <br  />
sth. that causes a large [ outflow | depletion ] <br  />
sth. consuming resources and providing nothing in return <br  />
an [ instance | cause ] of continuous diminution in [ resource || energy ]
</p>
<pre class="example">
That rental property is a [ drain ] on our finances.
</pre>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> dwell</h3>
<div class="outline-text-3" id="text-4-7">
<p>
<b>vt.1</b> <br  />
&lt; dwell on &gt; <br  />
to overthink <br  />
to [ think , speak , write ] at length about a particular subject <br  />
(esp. one that is a source of [ unhappiness || anxiety || dissatisfaction ])
</p>
<pre class="example">
I've got better things to do than [ dwell on ] the past.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> E</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> emerge</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>v.1</b> <br  />
to rise from [ water | liquid ] <br  />
to rise (as if) from immersion <br  />
to come up to the surface of [ water | liquid ] <br  />
to [ move out , move away ] from a surrounding [ fluid , covering | shelter ]
</p>
<pre class="example">
animals [ emerging ] from the forest
Sea mammals must [ emerge ] periodically to breathe.
</pre>

<p>
<b>v.2</b> <br  />
to come forth into view <br  />
(as from [ concealment || obscurity ])
</p>
<pre class="example">
The house [ emerged ] in the fog.
当她[ 出现 ]的时候，理查德正等候在门外。&gt;&gt; Richard was waiting outside the door as she [ emerged ].
她从法院大楼[ 出来 ]向支持者们表示感谢。&gt;&gt; She [ emerged ] from the courthouse to thank her supporters.
</pre>

<p>
<b>v.3</b> <br  />
to [ arise | turn up | come to light ] <br  />
to become [ evident | apparent || known || prominent ] <br  />
(after being in obscurity) <br  />
truth, evidence <code>+</code>
</p>
<pre class="example">
new leaders who may [ emerge ]
evidence that [ emerged ] from the investigation
The truth [ emerged ] at the inquest.
Some nice results [ emerged ] from the study.
Several interesting things [ emerged ] from the report.
过去几年中[ 暴露 ]出来的日趋严重的腐败 &gt;&gt; the growing corruption that has [ emerged ] in the past few years
很快[ 显示 ]的是 7 月和 8 月的抵押款都没有被收取。&gt;&gt; It soon [ emerged ] that neither the July nor August mortgage payment had been collected.
</pre>

<p>
<b>v.4</b> <br  />
to [ appear | come into existence || develop ]
</p>
<pre class="example">
a period when many new life forms [ emerged ]
1917 年 10 月[ 成立 ]的新共和国 &gt;&gt; the new republic that [ emerged ] in October 1917
</pre>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> employ</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>vt.1</b> <br  />
to hire <br  />
to have on the payroll <br  />
to provide work to sb. for pay <br  />
to [ engage , make use of ] the services of a person in return for money
</p>
<pre class="example">
agreed to [ employ ] the job applicant
该公司[ 雇用 ]18位职工。&gt;&gt; The company [ employs ] 18 staff.
超过3000名本地工人受[ 雇 ]于旅游业。&gt;&gt; More than 3,000 local workers are [ employed ] in the tourism industry.
</pre>

<p>
<b>vt.2</b> <br  />
to [ use | apply | utilize | make use of ] <br  />
to use as a means <br  />
to put sth. into [ use , service ] <br  />
( for a specific task ) <br  />
<code>+</code> method, measure, approach, tactic, skill
</p>
<pre class="example">
[ employed ] her skills in the new job
[ employed ] computers to solve the problem
to [ employ ] secret measures to get one's ends
the approaches and methods we [ employed ] in this study
该团体将[ 运用 ]混合策略来实现其目标。&gt;&gt; The group will [ employ ] a mix of tactics to achieve its aim.
</pre>

<p>
<b>vt.3</b> <br  />
to [ occupy | keep busy ] <br  />
to occupy the [ time || attention ] <br  />
to engage the [ attention , activity ] of
</p>
<pre class="example">
[ employed ] himself for an hour reading blogs
She was busily [ employed ] (in) writing letters.
</pre>

<p>
<b>vt.4</b> <br  />
to spend <br  />
to devote [ time || energy ] to a particular [ activity || purpose ]
</p>
<pre class="example">
[ employed ] several months in learning Swahili
Collecting stamps [ employs ] a lot of his time.
你的时间可以被有效地[ 利用 ]来上夜课。&gt;&gt; Your time could be usefully [ employed ] in attending night classes.
</pre>

<p>
<b>vt.5</b> <br  />
&lt;in the employ of&gt; <br  />
&lt;in sb.'s employ&gt; <br  />
[ hire | employ | engage ]d by <br  />
in the service of
</p>
<pre class="example">
They hinted that he was [ in the employ of ] the KGB.
</pre>
</div>
</div>
