general/english/en_vocab.org
** entail

*vt.1* \\
to [ involve | necessitate ] \\
to have as a logically necessary consequence \\
to involve as a [ necessary | inevitable ] [ part , consequence ] \\
意味着
: a situation that [ entails ] considerable risks
: Never engaging in an activity that [ entails ] risk.
: The ensuing debate [ entailed ] complex questions of constitutional law.
: He learned of a job posting that [ entailed ] working on computer systems while being stationed overseas.

** equivalent

*adj.1* \\
<equivalent to> \\
[ equal | interchangeable ] \\
being essentially equal, all things considered \\
having [ same | similar | identical ] [ effect || meaning ] \\
(as in [ value || quantity || meaning | significance ])
: a wish that was [ equivalent to ] a command
: His silence is [ equivalent to ] an admission of guilt.
: 去美国旅行一次[ 相当于 ]她两年的工资。>> A trip to America is [ equivalent to ] a two-year salary for her.

*n.1* \\
sth. that is [ virtually | essentially ] equal to another
: That Chinese word has no [ equivalent ] in English.

** exploit

*n.1* \\
a notable [ deed || feat || achievement ] \\
a [ act | deed ] , esp. a [ brilliant , noble , heroic ] one \\
[ brave | interesting | amusing ] things that someone has done
: 他战时的英勇[ 事迹 ]被改编成了电视剧。>> His wartime [ exploits ] were made into a TV series.

*vt.1* \\
to [ utilize | employ ] \\
to make the best use of \\
to gain an advantage from \\
to employ to the greatest possible advantage
: to [ exploit ] one's talents
: to [ exploit ] a business opportunity
: We must [ exploit ] the resources we are given wisely.
: The opposition are [ exploiting ] the situation to their advantage.
: 你需要一根好的天线来[ 充分利用 ]该电台的节目。>> You'll need a good antenna to [ exploit ] the radio's performance.

*vt.2* \\
to make use of [ selfishly , unethically ] \\
to [ use || manipulate ] to one's advantage \\
to use (a situation) to gain an advantage, rather than do what is right \\
to take advantage of a [ person, situation ], esp. [ unethically | unjustly | unfairly ] for one's own ends
: 政府及其反对者们竞相[ 利用 ]这些动乱来取得利益。>> The government and its opponents compete to [ exploit ] the troubles to their advantage.

*vt.3* \\
to overwork \\
to work excessively hard \\
to treat sb. unfairly by using one's [ work , idea ]s and giving very little in return
: a corporation that [ exploited ] peasant labor
: He is [ exploiting ] the students.
: Casual workers are being [ exploited ] for slave wages.
: 批评家们声称他为私利[ 利用 ]了黑人音乐家们。>> Critics claim he [ exploited ] black musicians for personal gain.

*vt.4* \\
to harness \\
to develop [ resource || raw material ]s \\
(and use them for [ industry , commercial activities ])
: to [ exploit ] natural resources
: 我想我们不[ 开采利用 ]自己的煤矿实在是目光短浅。>> I think we're being very short-sighted in not [ exploiting ] our own coal.

** extroverted

*adj.1* \\
[ gregarious | outgoing | forthcoming | sociable ] \\
at ease in talking to others \\
examining what is outside oneself \\
characterized by [ interest in , behavior directed toward ] [ others , the environment ] rather than oneself
: How do you spot [ extroverted ] software engineers?
: The oil field services company has a very clear idea of the personalities it’s seeking: [ extroverted ] engineers.

* F
** factual

*adj.1* \\
[ truthful | accurate | authentic | genuine ] \\
concerned with what is actually the case rather than [ interpretations of , reactions to ] it
: a mixture of comment and [ factual ] information
: One of the best [ factual ] aspects of the film is the accuracy of ...
** familiarity

*n.1* \\
< familiarity with > \\
[ awareness || experience || knowledge || understanding ] \\
close [ acquaintance with | knowledge of ] sth.
: her [ familiarity with ] Asian politics
: increase customer [ familiarity with ] a product

* G
** gauge

*vt.1* \\
to [ measure || calculate ] \\
to [ estimate || determine ] the [ magnitude || amount || volume ] of
: to [ gauge ] how much weight to place on interviews relative to everything else
: to [ gauge ] something that every company wants but few know how to measure: the ability to innovate
: Astronomers can [ gauge ] the star's intrinsic brightness.

* H
** hurdle

*n.1* \\
[ obstacle | difficulty ] \\
: There are many [ hurdles ] to overcome.

* I
** immediate

*adj.1* \\
[ instant | prompt ] \\
[ occure | happen | take place ]ing [ at once | without delay ] \\
=+= reply, reaction, effect
: needed [ immediate ] treatment for the injuries
: 这些悲惨事件已经有了[ 立杆见影的 ]结果。>> These tragic incidents have had an [ immediate ] effect.

*adj.2* \\
[ direct | proximate ] \\
[ closest , most direct ] in [ effect , relationship ] \\
immediately [ before , after ] as in a chain of cause and effect \\
[ act , occure ]ing without the interposition of another [ agent || object ] \\
=+= cause, result, influence
: 暴乱之后[ 紧接的 ]是一股希望与和解情绪的产生。>> In the [ immediate ] aftermath of the riots, a mood of hope and reconciliation sprang up.

*adj.3* \\
contiguous in time \\
[ of , near ] the present time \\
[ follow | preced ]ing without a lapse of time \\
=+= future, past

*adj.4* \\
[ close | near | adjacent | next to ] \\
close at hand \\
contiguous in space \\
having no [ object , space ] intervening \\
=+= contact, vicinity
: our [ immediate ] neighbour
: I was seated at Sauter's [ immediate ] left.
: Only a handful had returned to work in the [ immediate ] vicinity.
: They had 30 tonnes of ammunition in the [ immediate ] area of the beach.
: 只有少数几个人回到[ 附近 ]地区工作。>> Only a handful had returned to work in the [ immediate ] vicinity.

*adj.5* \\
[ present | current ] \\
[ of , pertaining to ] the present time \\
=+= problem, concern, priority, plan
: 救援机构称[ 当务之急 ]不是食品匮乏，而是交通运输不足。>> Relief agencies say the [ immediate ] problem is not a lack of food, but transportation.

*adj.6* \\
next in [ line , relation ] \\
[ contiguous || very close ] in relationship
: an [ immediate ] successor to the president of the company
: 他[ 直系 ]亲属的到场显然对他产生了镇定的效果。>> The presence of his [ immediate ] family is obviously having a calming effect on him.

