general/english/en_vocab.html
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> entail</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>vt.1</b> <br  />
to [ involve | necessitate ] <br  />
to have as a logically necessary consequence <br  />
to involve as a [ necessary | inevitable ] [ part , consequence ] <br  />
意味着
</p>
<pre class="example">
a situation that [ entails ] considerable risks
Never engaging in an activity that [ entails ] risk.
The ensuing debate [ entailed ] complex questions of constitutional law.
He learned of a job posting that [ entailed ] working on computer systems while being stationed overseas.
</pre>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> equivalent</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<b>adj.1</b> <br  />
&lt;equivalent to&gt; <br  />
[ equal | interchangeable ] <br  />
being essentially equal, all things considered <br  />
having [ same | similar | identical ] [ effect || meaning ] <br  />
(as in [ value || quantity || meaning | significance ])
</p>
<pre class="example">
a wish that was [ equivalent to ] a command
His silence is [ equivalent to ] an admission of guilt.
去美国旅行一次[ 相当于 ]她两年的工资。&gt;&gt; A trip to America is [ equivalent to ] a two-year salary for her.
</pre>

<p>
<b>n.1</b> <br  />
sth. that is [ virtually | essentially ] equal to another
</p>
<pre class="example">
That Chinese word has no [ equivalent ] in English.
</pre>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> exploit</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<b>n.1</b> <br  />
a notable [ deed || feat || achievement ] <br  />
a [ act | deed ] , esp. a [ brilliant , noble , heroic ] one <br  />
[ brave | interesting | amusing ] things that someone has done
</p>
<pre class="example">
他战时的英勇[ 事迹 ]被改编成了电视剧。&gt;&gt; His wartime [ exploits ] were made into a TV series.
</pre>

<p>
<b>vt.1</b> <br  />
to [ utilize | employ ] <br  />
to make the best use of <br  />
to gain an advantage from <br  />
to employ to the greatest possible advantage
</p>
<pre class="example">
to [ exploit ] one's talents
to [ exploit ] a business opportunity
We must [ exploit ] the resources we are given wisely.
The opposition are [ exploiting ] the situation to their advantage.
你需要一根好的天线来[ 充分利用 ]该电台的节目。&gt;&gt; You'll need a good antenna to [ exploit ] the radio's performance.
</pre>

<p>
<b>vt.2</b> <br  />
to make use of [ selfishly , unethically ] <br  />
to [ use || manipulate ] to one's advantage <br  />
to use (a situation) to gain an advantage, rather than do what is right <br  />
to take advantage of a [ person, situation ], esp. [ unethically | unjustly | unfairly ] for one's own ends
</p>
<pre class="example">
政府及其反对者们竞相[ 利用 ]这些动乱来取得利益。&gt;&gt; The government and its opponents compete to [ exploit ] the troubles to their advantage.
</pre>

<p>
<b>vt.3</b> <br  />
to overwork <br  />
to work excessively hard <br  />
to treat sb. unfairly by using one's [ work , idea ]s and giving very little in return
</p>
<pre class="example">
a corporation that [ exploited ] peasant labor
He is [ exploiting ] the students.
Casual workers are being [ exploited ] for slave wages.
批评家们声称他为私利[ 利用 ]了黑人音乐家们。&gt;&gt; Critics claim he [ exploited ] black musicians for personal gain.
</pre>

<p>
<b>vt.4</b> <br  />
to harness <br  />
to develop [ resource || raw material ]s <br  />
(and use them for [ industry , commercial activities ])
</p>
<pre class="example">
to [ exploit ] natural resources
我想我们不[ 开采利用 ]自己的煤矿实在是目光短浅。&gt;&gt; I think we're being very short-sighted in not [ exploiting ] our own coal.
</pre>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> extroverted</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<b>adj.1</b> <br  />
[ gregarious | outgoing | forthcoming | sociable ] <br  />
at ease in talking to others <br  />
examining what is outside oneself <br  />
characterized by [ interest in , behavior directed toward ] [ others , the environment ] rather than oneself
</p>
<pre class="example">
How do you spot [ extroverted ] software engineers?
The oil field services company has a very clear idea of the personalities it’s seeking: [ extroverted ] engineers.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> F</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> factual</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<b>adj.1</b> <br  />
[ truthful | accurate | authentic | genuine ] <br  />
concerned with what is actually the case rather than [ interpretations of , reactions to ] it
</p>
<pre class="example">
a mixture of comment and [ factual ] information
One of the best [ factual ] aspects of the film is the accuracy of ...
</pre>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> familiarity</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>n.1</b> <br  />
&lt; familiarity with &gt; <br  />
[ awareness || experience || knowledge || understanding ] <br  />
close [ acquaintance with | knowledge of ] sth.
</p>
<pre class="example">
her [ familiarity with ] Asian politics
increase customer [ familiarity with ] a product
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> G</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> gauge</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<b>vt.1</b> <br  />
to [ measure || calculate ] <br  />
to [ estimate || determine ] the [ magnitude || amount || volume ] of
</p>
<pre class="example">
to [ gauge ] how much weight to place on interviews relative to everything else
to [ gauge ] something that every company wants but few know how to measure: the ability to innovate
Astronomers can [ gauge ] the star's intrinsic brightness.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> H</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> hurdle</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<b>n.1</b> <br  />
[ obstacle | difficulty ] <br  />
</p>
<pre class="example">
There are many [ hurdles ] to overcome.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> I</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> immediate</h3>
<div class="outline-text-3" id="text-9-1">
<p>
<b>adj.1</b> <br  />
[ instant | prompt ] <br  />
[ occure | happen | take place ]ing [ at once | without delay ] <br  />
<code>+</code> reply, reaction, effect
</p>
<pre class="example">
needed [ immediate ] treatment for the injuries
这些悲惨事件已经有了[ 立杆见影的 ]结果。&gt;&gt; These tragic incidents have had an [ immediate ] effect.
</pre>

<p>
<b>adj.2</b> <br  />
[ direct | proximate ] <br  />
[ closest , most direct ] in [ effect , relationship ] <br  />
immediately [ before , after ] as in a chain of cause and effect <br  />
[ act , occure ]ing without the interposition of another [ agent || object ] <br  />
<code>+</code> cause, result, influence
</p>
<pre class="example">
暴乱之后[ 紧接的 ]是一股希望与和解情绪的产生。&gt;&gt; In the [ immediate ] aftermath of the riots, a mood of hope and reconciliation sprang up.
</pre>

<p>
<b>adj.3</b> <br  />
contiguous in time <br  />
[ of , near ] the present time <br  />
[ follow | preced ]ing without a lapse of time <br  />
<code>+</code> future, past
</p>

<p>
<b>adj.4</b> <br  />
[ close | near | adjacent | next to ] <br  />
close at hand <br  />
contiguous in space <br  />
having no [ object , space ] intervening <br  />
<code>+</code> contact, vicinity
</p>
<pre class="example">
our [ immediate ] neighbour
I was seated at Sauter's [ immediate ] left.
Only a handful had returned to work in the [ immediate ] vicinity.
They had 30 tonnes of ammunition in the [ immediate ] area of the beach.
只有少数几个人回到[ 附近 ]地区工作。&gt;&gt; Only a handful had returned to work in the [ immediate ] vicinity.
</pre>

<p>
<b>adj.5</b> <br  />
[ present | current ] <br  />
[ of , pertaining to ] the present time <br  />
<code>+</code> problem, concern, priority, plan
</p>
<pre class="example">
救援机构称[ 当务之急 ]不是食品匮乏，而是交通运输不足。&gt;&gt; Relief agencies say the [ immediate ] problem is not a lack of food, but transportation.
</pre>

<p>
<b>adj.6</b> <br  />
next in [ line , relation ] <br  />
[ contiguous || very close ] in relationship
</p>
<pre class="example">
an [ immediate ] successor to the president of the company
他[ 直系 ]亲属的到场显然对他产生了镇定的效果。&gt;&gt; The presence of his [ immediate ] family is obviously having a calming effect on him.
</pre>
</div>
</div>
