general/english/en_vocab.org
** implication

*n.1* \\
[ consequence | deduction | entailment ] \\
things that are likely to happen as a result \\
sth. that is [ infer | deduce | entail | imply ]d \\
subtle quality underlying a [ situation , action , person ] \\
可能的结果、影响 \\
political =+=
: His resignation had political [ implications ].
: 总检察长知道自己起诉的决定[ 可能引起的 ]政治[ 后果 ]。>> The Attorney General was aware of the political [ implications ] of his decision to prosecute.

*n.2* \\
[ significance | suggestion ] \\
implied meaning \\
indirect indication \\
implicit significance \\
what sth. [ imply | suggest ]s is the case \\
a meaning that is not expressly stated but can be inferred \\
sth. [ imply | suggest ]d as naturally to be [ infer || understand ]d \\
(of [ statement || event || situation ]) \\
言下之意，暗示
: He did not realize the full [ implications ] of his words.
: The [ implication ] of your silence is that you're bored.
: The expectation was spread both by word and by [ implication ].
: [ 含意 ]很明显：投票给我们，否则你会很难堪。>> The [ implication ] was obvious: vote for us or it will be very embarrassing for you.

** incentive

*n.1* \\
< incentive to > \\
[ stimulus | inducement | motivator ] \\
sth. that [ motivate | rouse | encourage ]s \\
a [ positive | motivating | motivational ] influence \\
sth. that [ cause || encourage ]s a given response \\
sth. that [ induce | motivate | incite ]s [ action | effort ] \\
(such as the [ fear of punishment , expectation of reward ])
: an [ incentive ] to work harder
: I have no [ incentive ] to do housework right now.
: Hope of promotion was an [ incentive ] to hard work.
: 几乎或根本没有[ 鼓励 ]来采取这样的措施。>> There is little [ incentive ] to adopt such measures.

*n.2* \\
[ bonus | reward ] \\
(often monetary)
: Management offered the sales team a $500 [ incentive ] for each car sold.

*adj.1* \\
inciting \\
serving to [ induce | motivate | incite ] to action
: an [ incentive ] bonus for high productivity

** indifferent

*adj.1* \\
< indifferent to/towards > \\
[ apathetic | uninterested | uncaring ] \\
not caring \\
without [ emotion || interest ] \\
[ feel | show ]ing no strong emotional involvement \\
[ have , show ]ing no (particular) [ care | concern | interest ]
: He was [ indifferent to ] my pleas.
: She remained [ indifferent toward ] their proposal.
: 人们已经变得对别人的痛苦[ 漠不关心 ]。>> People have become [ indifferent to ] the suffering of others.

*adj.2* \\
[ moderate | average | neutral ] \\
not particularly good \\
being neither good nor bad \\
being neither too much nor too little \\
being of no special [ quality || type ] \\
of only [ average | moderate ] [ size || extent || quality ]
: an [ indifferent ] specimen
: an [ indifferent ] performance
: has an [ indifferent ] singing voice
: a gifted painter but an [ indifferent ] actor
: has [ indifferent ] qualifications for the job
: 她领衔主演过好几部非常[ 平庸的 ]电影。>> She had starred in several [ indifferent ] movies.

*adj.3* \\
[ unbiased | impartial ] \\
free from bias in judgment \\
having no [ bias | preference ] \\
[ show , have ]ing no preferences \\
characterized by a lack of partiality \\
having no marked feeling [ for , against ]
: an [ indifferent ] judge
: a properly [ indifferent ] jury

*adj.4* \\
[ unimportant | immaterial ] \\
not mattering one way or the other
: It's [ indifferent ] to me which outfit you choose.
: What others think is altogether [ indifferent ] to him.

** indulge

*vt.1* \\
to [ gratify | satisfy | fulfill ] \\
to follow a [ wish || interest ] \\
to [ grant , have ] what is demanded by a [ need | desire ] \\
to [ yield to | gratify ] a [ temptation || desire | whim || feeling ] for \\
=+= desire, passion
: to [ indulge ] in new clothes
: to [ indulge ] a craving for chocolate
: to [ indulge ] a desire for new clothes
: His success has let him [ indulge ] his love of expensive cars.
: He [ indulges ] his love of food by dining at expensive restaurants.
: 她只是偶尔才会喝上杯葡萄酒。>> Only rarely will she [ indulge ] in a glass of wine.
: 他重返俄亥俄以[ 释放 ]自己对足球的激情。>> He returned to Ohio so that he could [ indulge ] his passion for football.

*vt.2* \\
to [ pamper | spoil ] \\
to give satisfaction to \\
to be [ lenient | permissive ] with \\
to treat with excessive indulgence \\
to [ yield to || satisfy ] the [ desire | wish | whim ]s of sb. \\
(esp. [ excessively | to an excessive degree ]) \\
=+= child
: He [ indulged ] them with money.
: We [ indulged ] our daughter on her birthday.
: 他不同意[ 娇惯 ]孩子。>> He did not agree with [ indulging ] children.

*vt.3* \\
<indulge oneself> \\
to allow oneself the pleasure of sth. \\
to allow to follow one's [ will || inclination ]
: to [ indulge oneself ] in reckless spending
: at Christmas he liked to [ indulge himself ]
: He eyed the desserts but didn't [ indulge ].
: You can [ indulge yourself ] without spending a fortune.
: Life would be very dull if we never [ indulged ourselves ].

** intangible

*adj.1* \\
not having physical presence \\
unable to be [ touch , grasp ]d
: My companions do not care about cyberspace or anything else so [ intangible ].

*adj.2* \\
[ vague | abstract ] \\
[ difficult , impossible ] to [ define || understand ]
: The rose symbolized something [ intangible ] about their relationship.

** intensive

*adj.1* \\
[ thorough | intense ] \\
to a great degree \\
[ of , relating to , characterized by ] intensity
: [ intensive ] training
: [ intensive ] questioning
: She was moved to the [ intensive ] care unit of the hospital.
: 几个日夜的[ 集中 ]谈判 >> several days and nights of [ intensive ] negotiations

*adj.2* \\
<-intensive> \\
demanding \\
[ possess || require ]ing to a high degree \\
using one factor of production proportionately more than others \\
[ require , have ]ing a high concentration of a specified [ quality || element ]
: [ capital-intensive ]
: a [ labor-intensive ] industry

*adj.3* \\
involving the maximum use of resources \\
intended to increase productivity of a fixed area by expending more [ capital || labor ]
: [ intensive ] agriculture
: [ 集约 ]饲养家禽的方法 >> [ intensive ] methods of rearing poultry

*adj.4* \\
tending to [ emphasize | intensify ]
: an [ intensive ] adverb

