general/english/en_vocab.html
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> implication</h3>
<div class="outline-text-3" id="text-9-2">
<p>
<b>n.1</b> <br  />
[ consequence | deduction | entailment ] <br  />
things that are likely to happen as a result <br  />
sth. that is [ infer | deduce | entail | imply ]d <br  />
subtle quality underlying a [ situation , action , person ] <br  />
可能的结果、影响 <br  />
political <code>+</code>
</p>
<pre class="example">
His resignation had political [ implications ].
总检察长知道自己起诉的决定[ 可能引起的 ]政治[ 后果 ]。&gt;&gt; The Attorney General was aware of the political [ implications ] of his decision to prosecute.
</pre>

<p>
<b>n.2</b> <br  />
[ significance | suggestion ] <br  />
implied meaning <br  />
indirect indication <br  />
implicit significance <br  />
what sth. [ imply | suggest ]s is the case <br  />
a meaning that is not expressly stated but can be inferred <br  />
sth. [ imply | suggest ]d as naturally to be [ infer || understand ]d <br  />
(of [ statement || event || situation ]) <br  />
言下之意，暗示
</p>
<pre class="example">
He did not realize the full [ implications ] of his words.
The [ implication ] of your silence is that you're bored.
The expectation was spread both by word and by [ implication ].
[ 含意 ]很明显：投票给我们，否则你会很难堪。&gt;&gt; The [ implication ] was obvious: vote for us or it will be very embarrassing for you.
</pre>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> incentive</h3>
<div class="outline-text-3" id="text-9-3">
<p>
<b>n.1</b> <br  />
&lt; incentive to &gt; <br  />
[ stimulus | inducement | motivator ] <br  />
sth. that [ motivate | rouse | encourage ]s <br  />
a [ positive | motivating | motivational ] influence <br  />
sth. that [ cause || encourage ]s a given response <br  />
sth. that [ induce | motivate | incite ]s [ action | effort ] <br  />
(such as the [ fear of punishment , expectation of reward ])
</p>
<pre class="example">
an [ incentive ] to work harder
I have no [ incentive ] to do housework right now.
Hope of promotion was an [ incentive ] to hard work.
几乎或根本没有[ 鼓励 ]来采取这样的措施。&gt;&gt; There is little [ incentive ] to adopt such measures.
</pre>

<p>
<b>n.2</b> <br  />
[ bonus | reward ] <br  />
(often monetary)
</p>
<pre class="example">
Management offered the sales team a $500 [ incentive ] for each car sold.
</pre>

<p>
<b>adj.1</b> <br  />
inciting <br  />
serving to [ induce | motivate | incite ] to action
</p>
<pre class="example">
an [ incentive ] bonus for high productivity
</pre>
</div>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> indifferent</h3>
<div class="outline-text-3" id="text-9-4">
<p>
<b>adj.1</b> <br  />
&lt; indifferent to/towards &gt; <br  />
[ apathetic | uninterested | uncaring ] <br  />
not caring <br  />
without [ emotion || interest ] <br  />
[ feel | show ]ing no strong emotional involvement <br  />
[ have , show ]ing no (particular) [ care | concern | interest ]
</p>
<pre class="example">
He was [ indifferent to ] my pleas.
She remained [ indifferent toward ] their proposal.
人们已经变得对别人的痛苦[ 漠不关心 ]。&gt;&gt; People have become [ indifferent to ] the suffering of others.
</pre>

<p>
<b>adj.2</b> <br  />
[ moderate | average | neutral ] <br  />
not particularly good <br  />
being neither good nor bad <br  />
being neither too much nor too little <br  />
being of no special [ quality || type ] <br  />
of only [ average | moderate ] [ size || extent || quality ]
</p>
<pre class="example">
an [ indifferent ] specimen
an [ indifferent ] performance
has an [ indifferent ] singing voice
a gifted painter but an [ indifferent ] actor
has [ indifferent ] qualifications for the job
她领衔主演过好几部非常[ 平庸的 ]电影。&gt;&gt; She had starred in several [ indifferent ] movies.
</pre>

<p>
<b>adj.3</b> <br  />
[ unbiased | impartial ] <br  />
free from bias in judgment <br  />
having no [ bias | preference ] <br  />
[ show , have ]ing no preferences <br  />
characterized by a lack of partiality <br  />
having no marked feeling [ for , against ]
</p>
<pre class="example">
an [ indifferent ] judge
a properly [ indifferent ] jury
</pre>

<p>
<b>adj.4</b> <br  />
[ unimportant | immaterial ] <br  />
not mattering one way or the other
</p>
<pre class="example">
It's [ indifferent ] to me which outfit you choose.
What others think is altogether [ indifferent ] to him.
</pre>
</div>
</div>
<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> indulge</h3>
<div class="outline-text-3" id="text-9-5">
<p>
<b>vt.1</b> <br  />
to [ gratify | satisfy | fulfill ] <br  />
to follow a [ wish || interest ] <br  />
to [ grant , have ] what is demanded by a [ need | desire ] <br  />
to [ yield to | gratify ] a [ temptation || desire | whim || feeling ] for <br  />
<code>+</code> desire, passion
</p>
<pre class="example">
to [ indulge ] in new clothes
to [ indulge ] a craving for chocolate
to [ indulge ] a desire for new clothes
His success has let him [ indulge ] his love of expensive cars.
He [ indulges ] his love of food by dining at expensive restaurants.
她只是偶尔才会喝上杯葡萄酒。&gt;&gt; Only rarely will she [ indulge ] in a glass of wine.
他重返俄亥俄以[ 释放 ]自己对足球的激情。&gt;&gt; He returned to Ohio so that he could [ indulge ] his passion for football.
</pre>

<p>
<b>vt.2</b> <br  />
to [ pamper | spoil ] <br  />
to give satisfaction to <br  />
to be [ lenient | permissive ] with <br  />
to treat with excessive indulgence <br  />
to [ yield to || satisfy ] the [ desire | wish | whim ]s of sb. <br  />
(esp. [ excessively | to an excessive degree ]) <br  />
<code>+</code> child
</p>
<pre class="example">
He [ indulged ] them with money.
We [ indulged ] our daughter on her birthday.
他不同意[ 娇惯 ]孩子。&gt;&gt; He did not agree with [ indulging ] children.
</pre>

<p>
<b>vt.3</b> <br  />
&lt;indulge oneself&gt; <br  />
to allow oneself the pleasure of sth. <br  />
to allow to follow one's [ will || inclination ]
</p>
<pre class="example">
to [ indulge oneself ] in reckless spending
at Christmas he liked to [ indulge himself ]
He eyed the desserts but didn't [ indulge ].
You can [ indulge yourself ] without spending a fortune.
Life would be very dull if we never [ indulged ourselves ].
</pre>
</div>
</div>
<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> intangible</h3>
<div class="outline-text-3" id="text-9-6">
<p>
<b>adj.1</b> <br  />
not having physical presence <br  />
unable to be [ touch , grasp ]d
</p>
<pre class="example">
My companions do not care about cyberspace or anything else so [ intangible ].
</pre>

<p>
<b>adj.2</b> <br  />
[ vague | abstract ] <br  />
[ difficult , impossible ] to [ define || understand ]
</p>
<pre class="example">
The rose symbolized something [ intangible ] about their relationship.
</pre>
</div>
</div>
<div id="outline-container-sec-9-7" class="outline-3">
<h3 id="sec-9-7"><span class="section-number-3">9.7</span> intensive</h3>
<div class="outline-text-3" id="text-9-7">
<p>
<b>adj.1</b> <br  />
[ thorough | intense ] <br  />
to a great degree <br  />
[ of , relating to , characterized by ] intensity
</p>
<pre class="example">
[ intensive ] training
[ intensive ] questioning
She was moved to the [ intensive ] care unit of the hospital.
几个日夜的[ 集中 ]谈判 &gt;&gt; several days and nights of [ intensive ] negotiations
</pre>

<p>
<b>adj.2</b> <br  />
&lt;-intensive&gt; <br  />
demanding <br  />
[ possess || require ]ing to a high degree <br  />
using one factor of production proportionately more than others <br  />
[ require , have ]ing a high concentration of a specified [ quality || element ]
</p>
<pre class="example">
[ capital-intensive ]
a [ labor-intensive ] industry
</pre>

<p>
<b>adj.3</b> <br  />
involving the maximum use of resources <br  />
intended to increase productivity of a fixed area by expending more [ capital || labor ]
</p>
<pre class="example">
[ intensive ] agriculture
[ 集约 ]饲养家禽的方法 &gt;&gt; [ intensive ] methods of rearing poultry
</pre>

<p>
<b>adj.4</b> <br  />
tending to [ emphasize | intensify ]
</p>
<pre class="example">
an [ intensive ] adverb
</pre>
</div>
</div>
