general/english/en_vocab.org
** intent

*n.1* \\
[ aim | purpose | intention || design ] \\
sth. that is intended \\
what one intends to [ do , achieve ] \\
an anticipated outcome that [ is intended , guides your planned actions ]
: The original [ intent ] was to raise funds.
: His [ intent ] was to provide a new translation.
: 发表这项[ 意图 ]实施军备控制的强硬声明的时机至关重要。>> The timing of this strong statement of [ intent ] on arms control is crucial.

*n.2* \\
the [ act , fact ] of intending
: criminal [ intent ]
: The rebels are obviously [ intent ] on stepping up the pressure.

*n.3* \\
[ connotation || significance ] \\
implicit meaning \\
that which is signified by a [ word || expression ]

*expr.1* \\
< to all intents and purposes > \\
[ virtually | effectively | practically speaking ] \\
for all practical purposes
: 他[ 实际上 ]可以称得上是我的父亲。>> [ To all intents and purposes ] he was my father.
** internalize

*vt.1* \\
to make [ attitude || behavior ] part of one's nature by [ learning , unconscious assimilation ] \\
to incorporate within oneself (cultural values of others) through [ learning , socialization , identification ]
: to [ internalize ] a belief
: He had [ internalized ] the cultural values of the Poles after a year of living in Warsaw.

** intuition

*n.1* \\
instinct \\
the ability to understand sth. immediately, without the need for conscious reasoning
: We shall allow our [ intuition ] to guide us.
: It doesn't take much coder's [ intuition ] to see that ... is not optimal.
: Interviewers ought to know that innovation takes persistence, [ intuition ], and luck.

*n.2* \\
[ sense | hunch ] \\
a thing that one [ know , consider ]s likely from instinctive feeling rather than conscious reasoning
: The near-universal [ intuition ] is that ...
: Your insights and [ intuitions ] as a native speaker are positively sought.

* J
** jargon

*n.1* \\
specialized language \\
special [ word || expression ]s that are used by a particular [ profession || group ] and are difficult for others to understand
: legal [ jargon ]
: The psychology of creativity has its own [ jargon ] and journals.

* L
** languish

*vi.1* \\
to [ fade | droop ] \\
to [ be , become ] [ weak | feeble ] \\
to [ lose || diminish in ] [ strength | energy | vigor | vitality ]
: crops [ languishing ] from a lack of rain
: 由于没有创始人的干劲和指导，这家公司逐渐[ 衰败 ]了。>> Without the founder's drive and direction, the company gradually [ languished ].

*vi.2* \\
to suffer [ deprivation |  hardship | distress || neglect ] \\
to [ exist , continue ] in [ miserable | disheartening ] conditions
: 他继续在牢里[ 受折磨 ]。>> He continues to [ languish ] in prison.
: The prisoner has be [ languishing ] for years in the dungeon.

*vi.3* \\
to [ remain , be ] [ unattended | neglected | disregarded ]
: legislation that continued to [ languish ] in committee
: New products [ languish ] on the drawing board.
: The results of her research languished for years before action was taken.

*vi.4* \\
to pine \\
to be listless with desire \\
to become [ downcast , pine away ] in longing
: [ languish ] apart from friends and family
: [ languish ] for a change from dull routine
: a bride [ languishing ] for a kiss that never comes

** largely

*adv.1* \\
[ mostly | mainly | chiefly ] \\
on the whole \\
to a great extent
: He was soon arrested, [ largely ] through the efforts of ...
: I [ largely ] work with people who are already motivated.
: The underlying problems have been festering for years, [ largely ] in the dark.

** long-standing

*adj.1* \\
[ enduring | long-lasting | time-honoured ] \\
of long [ duration || existence ] \\
[ existing || in effect ] for a long time \\
describing sth. that has existed for a long time \\
=+= friendship, dispute
: a [ long-standing ] sense of historical victimhood
: 他们即将要解决彼此之间[ 为时已久的 ]金钱争议。>> They are on the brink of resolving their [ long-standing ] dispute over money.

* N
** negligible

*adj.1* \\
[ trivial | insignificant ] \\
so [ small || unimportant ] as to be not worth considering
: Sound could at last be recorded with incredible ease and at [ negligible ] cost.

** no-brainer

*n.1* \\
sth. that [ require | involve ]s [ little , no ] mental effort

* O
** offbeat

*adj.1* \\
[ unusual | unconventional | eccentric ] \\
out of the ordinary
: She's a little [ offbeat ], but she's a wonderful actress.
: In many industries, [ offbeat ] interview questions are a badge of coolness.

** overall

*adj.1* \\
from one [ end | limit ] to the other
: the [ overall ] length of the house

*adj.2* \\
[ comprehensive | global | gross ] \\
[ include | cover ]ing everything
: the [ overall ] costs of medical care
: Cut down your [ overall ] intake of calories.
: 失业人数的[ 总体 ]上升 >> the [ overall ] rise in unemployment

*adj.3* \\
general \\
regarded as a whole \\
involving only main features
: My [ overall ] impression was favorable.

** overwhelming

*adj.1* \\
[ enormous | immense | massive ] \\
very great in amount
: He was elected president by an [ overwhelming ] majority.

*adj.2* \\
very strong \\
(esp. of an emotion)
: an [ overwhelming ] feeling of gratitude

* P
