general/english/en_vocab.html
<div id="outline-container-sec-9-8" class="outline-3">
<h3 id="sec-9-8"><span class="section-number-3">9.8</span> intent</h3>
<div class="outline-text-3" id="text-9-8">
<p>
<b>n.1</b> <br  />
[ aim | purpose | intention || design ] <br  />
sth. that is intended <br  />
what one intends to [ do , achieve ] <br  />
an anticipated outcome that [ is intended , guides your planned actions ]
</p>
<pre class="example">
The original [ intent ] was to raise funds.
His [ intent ] was to provide a new translation.
发表这项[ 意图 ]实施军备控制的强硬声明的时机至关重要。&gt;&gt; The timing of this strong statement of [ intent ] on arms control is crucial.
</pre>

<p>
<b>n.2</b> <br  />
the [ act , fact ] of intending
</p>
<pre class="example">
criminal [ intent ]
The rebels are obviously [ intent ] on stepping up the pressure.
</pre>

<p>
<b>n.3</b> <br  />
[ connotation || significance ] <br  />
implicit meaning <br  />
that which is signified by a [ word || expression ]
</p>

<p>
<b>expr.1</b> <br  />
&lt; to all intents and purposes &gt; <br  />
[ virtually | effectively | practically speaking ] <br  />
for all practical purposes
</p>
<pre class="example">
他[ 实际上 ]可以称得上是我的父亲。&gt;&gt; [ To all intents and purposes ] he was my father.
</pre>
</div>
</div>

<div id="outline-container-sec-9-9" class="outline-3">
<h3 id="sec-9-9"><span class="section-number-3">9.9</span> internalize</h3>
<div class="outline-text-3" id="text-9-9">
<p>
<b>vt.1</b> <br  />
to make [ attitude || behavior ] part of one's nature by [ learning , unconscious assimilation ] <br  />
to incorporate within oneself (cultural values of others) through [ learning , socialization , identification ]
</p>
<pre class="example">
to [ internalize ] a belief
He had [ internalized ] the cultural values of the Poles after a year of living in Warsaw.
</pre>
</div>
</div>
<div id="outline-container-sec-9-10" class="outline-3">
<h3 id="sec-9-10"><span class="section-number-3">9.10</span> intuition</h3>
<div class="outline-text-3" id="text-9-10">
<p>
<b>n.1</b> <br  />
instinct <br  />
the ability to understand sth. immediately, without the need for conscious reasoning
</p>
<pre class="example">
We shall allow our [ intuition ] to guide us.
It doesn't take much coder's [ intuition ] to see that ... is not optimal.
Interviewers ought to know that innovation takes persistence, [ intuition ], and luck.
</pre>

<p>
<b>n.2</b> <br  />
[ sense | hunch ] <br  />
a thing that one [ know , consider ]s likely from instinctive feeling rather than conscious reasoning
</p>
<pre class="example">
The near-universal [ intuition ] is that ...
Your insights and [ intuitions ] as a native speaker are positively sought.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> J</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> jargon</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<b>n.1</b> <br  />
specialized language <br  />
special [ word || expression ]s that are used by a particular [ profession || group ] and are difficult for others to understand
</p>
<pre class="example">
legal [ jargon ]
The psychology of creativity has its own [ jargon ] and journals.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> L</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> languish</h3>
<div class="outline-text-3" id="text-11-1">
<p>
<b>vi.1</b> <br  />
to [ fade | droop ] <br  />
to [ be , become ] [ weak | feeble ] <br  />
to [ lose || diminish in ] [ strength | energy | vigor | vitality ]
</p>
<pre class="example">
crops [ languishing ] from a lack of rain
由于没有创始人的干劲和指导，这家公司逐渐[ 衰败 ]了。&gt;&gt; Without the founder's drive and direction, the company gradually [ languished ].
</pre>

<p>
<b>vi.2</b> <br  />
to suffer [ deprivation |  hardship | distress || neglect ] <br  />
to [ exist , continue ] in [ miserable | disheartening ] conditions
</p>
<pre class="example">
他继续在牢里[ 受折磨 ]。&gt;&gt; He continues to [ languish ] in prison.
The prisoner has be [ languishing ] for years in the dungeon.
</pre>

<p>
<b>vi.3</b> <br  />
to [ remain , be ] [ unattended | neglected | disregarded ]
</p>
<pre class="example">
legislation that continued to [ languish ] in committee
New products [ languish ] on the drawing board.
The results of her research languished for years before action was taken.
</pre>

<p>
<b>vi.4</b> <br  />
to pine <br  />
to be listless with desire <br  />
to become [ downcast , pine away ] in longing
</p>
<pre class="example">
[ languish ] apart from friends and family
[ languish ] for a change from dull routine
a bride [ languishing ] for a kiss that never comes
</pre>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> largely</h3>
<div class="outline-text-3" id="text-11-2">
<p>
<b>adv.1</b> <br  />
[ mostly | mainly | chiefly ] <br  />
on the whole <br  />
to a great extent
</p>
<pre class="example">
He was soon arrested, [ largely ] through the efforts of ...
I [ largely ] work with people who are already motivated.
The underlying problems have been festering for years, [ largely ] in the dark.
</pre>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> long-standing</h3>
<div class="outline-text-3" id="text-11-3">
<p>
<b>adj.1</b> <br  />
[ enduring | long-lasting | time-honoured ] <br  />
of long [ duration || existence ] <br  />
[ existing || in effect ] for a long time <br  />
describing sth. that has existed for a long time <br  />
<code>+</code> friendship, dispute
</p>
<pre class="example">
a [ long-standing ] sense of historical victimhood
他们即将要解决彼此之间[ 为时已久的 ]金钱争议。&gt;&gt; They are on the brink of resolving their [ long-standing ] dispute over money.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> N</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> negligible</h3>
<div class="outline-text-3" id="text-12-1">
<p>
<b>adj.1</b> <br  />
[ trivial | insignificant ] <br  />
so [ small || unimportant ] as to be not worth considering
</p>
<pre class="example">
Sound could at last be recorded with incredible ease and at [ negligible ] cost.
</pre>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> no-brainer</h3>
<div class="outline-text-3" id="text-12-2">
<p>
<b>n.1</b> <br  />
sth. that [ require | involve ]s [ little , no ] mental effort
</p>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> O</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> offbeat</h3>
<div class="outline-text-3" id="text-13-1">
<p>
<b>adj.1</b> <br  />
[ unusual | unconventional | eccentric ] <br  />
out of the ordinary
</p>
<pre class="example">
She's a little [ offbeat ], but she's a wonderful actress.
In many industries, [ offbeat ] interview questions are a badge of coolness.
</pre>
</div>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> overall</h3>
<div class="outline-text-3" id="text-13-2">
<p>
<b>adj.1</b> <br  />
from one [ end | limit ] to the other
</p>
<pre class="example">
the [ overall ] length of the house
</pre>

<p>
<b>adj.2</b> <br  />
[ comprehensive | global | gross ] <br  />
[ include | cover ]ing everything
</p>
<pre class="example">
the [ overall ] costs of medical care
Cut down your [ overall ] intake of calories.
失业人数的[ 总体 ]上升 &gt;&gt; the [ overall ] rise in unemployment
</pre>

<p>
<b>adj.3</b> <br  />
general <br  />
regarded as a whole <br  />
involving only main features
</p>
<pre class="example">
My [ overall ] impression was favorable.
</pre>
</div>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> overwhelming</h3>
<div class="outline-text-3" id="text-13-3">
<p>
<b>adj.1</b> <br  />
[ enormous | immense | massive ] <br  />
very great in amount
</p>
<pre class="example">
He was elected president by an [ overwhelming ] majority.
</pre>

<p>
<b>adj.2</b> <br  />
very strong <br  />
(esp. of an emotion)
</p>
<pre class="example">
an [ overwhelming ] feeling of gratitude
</pre>
</div>
</div>
</div>
