general/english/en_vocab.org
** painstaking

*adj.1* \\
careful \\
carefully attentive to details \\
[ expend || show ]ing diligent [ care || effort ] \\
diligent in performing a [ process | procedure ] \\
[ act with || show || involve ]ing great [ care| attention ] \\
[ showing , marked by ] attentiveness to all [ aspect || detail ]s \\
=+= search, examination, research, investigation, preparation
: Children receive [ painstaking ] care from their parents.
: Forensic experts carried out a [ painstaking ] search of the debris.
: The event had been planned with [ painstaking ] attention to detail.
: Despite all the detailed planning, all the [ painstaking ] preparation, within minutes it had all just gone wrong.

** particularly

*adv.1* \\
[ especially | exceptionally | uncommonly ] \\
to a [ great | exceptional ] degree \\
to a distinctly greater [ extent | degree ] than is common \\
尤其地
: in many countries, [ particularly ] France
: I wasn't [ particularly ] successful.
: I [ particularly ] like the brown shoes.
: He was [ particularly ] fussy about spelling.
: Keep your office space looking good, [ particularly ] your desk.
: The number of fatal road accidents has been [ particularly ] high.
: More local employment will be created, [ particularly ] in service industries.

*adv.2* \\
[ uniquely | characteristically ] \\
[ individually | specifically | in particular ] \\
with particular [ reference || emphasis ] \\
[ specifically | especially ] distinguished from others \\
特别地
: Do you want it [ particularly ] for tomorrow?
: I [ particularly ] asked for a seat by the window.
: Everyone has a moment in history which belongs [ particularly ] to him.

** perception

*n.1* \\
the [ act , effect ] of perceiving \\
the [ process , state ] of being aware of sth. \\
the process of [ perceive | be aware of ]ing sth. [ with , via ] the senses \\
a single unified awareness derived from sensory processes while a stimulus is present
: the [ perception ] of time
: the [ perception ] of a faint sound

*n.2* \\
[ opinion | view | impression || interpretation || belief ] \\
[ awareness | cognition | consciousness ] \\
way of [ perceive | conceive ]ing \\
the [ act | faculty ] of apprehending by means of the [ sense || mind ]
: advertising affects the customer's [ perception ] of a product
: doctors working to change the public [ perception ] of certain diseases
: Luther had a new [ perception ] of the Bible.

*n.3* \\
[ insight | discernment ] \\
[ insight | knowledge || intuition ] gained by [ think | perceive ]ing \\
[ immediate || intuitive ] [ recognition || appreciation ] \\
(as of [ moral || psychological || aesthetic ] qualities)
: a man admired for the depth of his [ perception ]
: the [ perception ] that inheritance must be coded in DNA

*n.4* \\
the [ ability | capacity ] to perceive \\
the capacity for such [ insight || knowledge ]
: theories of how to enhance human [ perception ]

** perpetual

*adj.1* \\
[ endless | eternal | permanent | everlasting ]
never [ end , change ]ing
: deep caves in [ perpetual ] darkness
: The U.S. and the Soviet Union held the whole planet in their [ perpetual ] hostage crisis called the Cold War.

** plainly

*adv.1* \\
[ obviously | evidently | apparently | unmistakably ]
: You will see that ours is [ plainly ] the better method.
: 他[ 明显 ]是生气了。>> He was [ plainly ] annoyed.
: 法官的结论[ 显然 ]是错误的。>> The judge's conclusion was [ plainly ] wrong.

*adv.2* \\
clearly
: I can remember it all quite [ plainly ].
: 我可以[ 清楚地 ]看到他将头向右转然后又向左转。>> I could [ plainly ] see him turning his head to the right and left.

*adv.3* \\
simply \\
in a plain manner, without [ extravagance | embellishment ]
: She was dressed [ plainly ].
: She decorated the room [ plainly ] but neatly.

** plausible

*adj.1* \\
[ reasonable | feasible || possible | likely ] \\
(of a [ argument | statement ]) seeming [ reasonable | probable ]
: a [ plausible ] explanation

** preoccupied

*adj.1* \\
< be preoccupied with > \\
[ obsessed || concerned || absorbed ] \\
(of a [ matter , subject ]) [ dominate || engross ] the mind of sb. to the exclusion of other thoughts
: His mother [ was preoccupied with ] paying the bills.

** predicament

*n.1* \\
difficulty \\
a [ difficult || unpleasant | embarrassing ] situation
: the club's financial [ predicament ]
: The [ predicament ] is easy to understand in this extreme case.

** preliminary

*adj.1* \\
[ initial | introductory | early ] \\
denoting a [ action || event ] [ preceding , done in preparation for ] sth. fuller or more important
: the [ preliminary ] mapping of the visible universe
: The discussions are still at a [ preliminary ] stage.

** premature

*adj.1* \\
[ early | untimely ] \\
[ uncommonly | unexpectedly ] early \\
[ occure , grow , exist ]ing before the [ normal || correct || expected || customary || assigned ] time \\
=+= end, death
: a [ premature ] announcement
: a man suffering from [ premature ] baldness
: Illness led to his [ premature ] death.
: 事故仍然是美国人非自然死亡的首要原因。>> Accidents are still the number one cause of [ premature ] death for Americans.
: 他的职业生涯因连续的膝伤[ 过早 ]地结束了。>> His career was brought to a [ premature ] end by a succession of knee injuries.

*adj.2* \\
[ impulsive | hasty ]
: a [ premature ] judgment
: 目前，他们的乐观好像还[ 为时过早 ]。>> It now seems their optimism was [ premature ].

*adj.3* \\
preterm \\
born after a gestation period of less than the normal time
: a [ premature ] infant
: a greater risk of having a [ premature ] baby

** premise

*n.1* \\
[ proposition | assumption | hypothesis ] \\
an [ assertion || proposition ] which forms the basis for a [ work , theory ]
: the fundamental [ premise ] of the report
: the [ premise ] that human life consists of a series of choices
: The [ premise ] of biodata is that “behavior predicts behavior.”

