general/english/en_vocab.html
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> P</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> painstaking</h3>
<div class="outline-text-3" id="text-14-1">
<p>
<b>adj.1</b> <br  />
careful <br  />
carefully attentive to details <br  />
[ expend || show ]ing diligent [ care || effort ] <br  />
diligent in performing a [ process | procedure ] <br  />
[ act with || show || involve ]ing great [ care| attention ] <br  />
[ showing , marked by ] attentiveness to all [ aspect || detail ]s <br  />
<code>+</code> search, examination, research, investigation, preparation
</p>
<pre class="example">
Children receive [ painstaking ] care from their parents.
Forensic experts carried out a [ painstaking ] search of the debris.
The event had been planned with [ painstaking ] attention to detail.
Despite all the detailed planning, all the [ painstaking ] preparation, within minutes it had all just gone wrong.
</pre>
</div>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> particularly</h3>
<div class="outline-text-3" id="text-14-2">
<p>
<b>adv.1</b> <br  />
[ especially | exceptionally | uncommonly ] <br  />
to a [ great | exceptional ] degree <br  />
to a distinctly greater [ extent | degree ] than is common <br  />
尤其地
</p>
<pre class="example">
in many countries, [ particularly ] France
I wasn't [ particularly ] successful.
I [ particularly ] like the brown shoes.
He was [ particularly ] fussy about spelling.
Keep your office space looking good, [ particularly ] your desk.
The number of fatal road accidents has been [ particularly ] high.
More local employment will be created, [ particularly ] in service industries.
</pre>

<p>
<b>adv.2</b> <br  />
[ uniquely | characteristically ] <br  />
[ individually | specifically | in particular ] <br  />
with particular [ reference || emphasis ] <br  />
[ specifically | especially ] distinguished from others <br  />
特别地
</p>
<pre class="example">
Do you want it [ particularly ] for tomorrow?
I [ particularly ] asked for a seat by the window.
Everyone has a moment in history which belongs [ particularly ] to him.
</pre>
</div>
</div>
<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3"><span class="section-number-3">14.3</span> perception</h3>
<div class="outline-text-3" id="text-14-3">
<p>
<b>n.1</b> <br  />
the [ act , effect ] of perceiving <br  />
the [ process , state ] of being aware of sth. <br  />
the process of [ perceive | be aware of ]ing sth. [ with , via ] the senses <br  />
a single unified awareness derived from sensory processes while a stimulus is present
</p>
<pre class="example">
the [ perception ] of time
the [ perception ] of a faint sound
</pre>

<p>
<b>n.2</b> <br  />
[ opinion | view | impression || interpretation || belief ] <br  />
[ awareness | cognition | consciousness ] <br  />
way of [ perceive | conceive ]ing <br  />
the [ act | faculty ] of apprehending by means of the [ sense || mind ]
</p>
<pre class="example">
advertising affects the customer's [ perception ] of a product
doctors working to change the public [ perception ] of certain diseases
Luther had a new [ perception ] of the Bible.
</pre>

<p>
<b>n.3</b> <br  />
[ insight | discernment ] <br  />
[ insight | knowledge || intuition ] gained by [ think | perceive ]ing <br  />
[ immediate || intuitive ] [ recognition || appreciation ] <br  />
(as of [ moral || psychological || aesthetic ] qualities)
</p>
<pre class="example">
a man admired for the depth of his [ perception ]
the [ perception ] that inheritance must be coded in DNA
</pre>

<p>
<b>n.4</b> <br  />
the [ ability | capacity ] to perceive <br  />
the capacity for such [ insight || knowledge ]
</p>
<pre class="example">
theories of how to enhance human [ perception ]
</pre>
</div>
</div>
<div id="outline-container-sec-14-4" class="outline-3">
<h3 id="sec-14-4"><span class="section-number-3">14.4</span> perpetual</h3>
<div class="outline-text-3" id="text-14-4">
<p>
<b>adj.1</b> <br  />
[ endless | eternal | permanent | everlasting ]
never [ end , change ]ing
</p>
<pre class="example">
deep caves in [ perpetual ] darkness
The U.S. and the Soviet Union held the whole planet in their [ perpetual ] hostage crisis called the Cold War.
</pre>
</div>
</div>
<div id="outline-container-sec-14-5" class="outline-3">
<h3 id="sec-14-5"><span class="section-number-3">14.5</span> plainly</h3>
<div class="outline-text-3" id="text-14-5">
<p>
<b>adv.1</b> <br  />
[ obviously | evidently | apparently | unmistakably ]
</p>
<pre class="example">
You will see that ours is [ plainly ] the better method.
他[ 明显 ]是生气了。&gt;&gt; He was [ plainly ] annoyed.
法官的结论[ 显然 ]是错误的。&gt;&gt; The judge's conclusion was [ plainly ] wrong.
</pre>

<p>
<b>adv.2</b> <br  />
clearly
</p>
<pre class="example">
I can remember it all quite [ plainly ].
我可以[ 清楚地 ]看到他将头向右转然后又向左转。&gt;&gt; I could [ plainly ] see him turning his head to the right and left.
</pre>

<p>
<b>adv.3</b> <br  />
simply <br  />
in a plain manner, without [ extravagance | embellishment ]
</p>
<pre class="example">
She was dressed [ plainly ].
She decorated the room [ plainly ] but neatly.
</pre>
</div>
</div>
<div id="outline-container-sec-14-6" class="outline-3">
<h3 id="sec-14-6"><span class="section-number-3">14.6</span> plausible</h3>
<div class="outline-text-3" id="text-14-6">
<p>
<b>adj.1</b> <br  />
[ reasonable | feasible || possible | likely ] <br  />
(of a [ argument | statement ]) seeming [ reasonable | probable ]
</p>
<pre class="example">
a [ plausible ] explanation
</pre>
</div>
</div>
<div id="outline-container-sec-14-7" class="outline-3">
<h3 id="sec-14-7"><span class="section-number-3">14.7</span> preoccupied</h3>
<div class="outline-text-3" id="text-14-7">
<p>
<b>adj.1</b> <br  />
&lt; be preoccupied with &gt; <br  />
[ obsessed || concerned || absorbed ] <br  />
(of a [ matter , subject ]) [ dominate || engross ] the mind of sb. to the exclusion of other thoughts
</p>
<pre class="example">
His mother [ was preoccupied with ] paying the bills.
</pre>
</div>
</div>
<div id="outline-container-sec-14-8" class="outline-3">
<h3 id="sec-14-8"><span class="section-number-3">14.8</span> predicament</h3>
<div class="outline-text-3" id="text-14-8">
<p>
<b>n.1</b> <br  />
difficulty <br  />
a [ difficult || unpleasant | embarrassing ] situation
</p>
<pre class="example">
the club's financial [ predicament ]
The [ predicament ] is easy to understand in this extreme case.
</pre>
</div>
</div>
<div id="outline-container-sec-14-9" class="outline-3">
<h3 id="sec-14-9"><span class="section-number-3">14.9</span> preliminary</h3>
<div class="outline-text-3" id="text-14-9">
<p>
<b>adj.1</b> <br  />
[ initial | introductory | early ] <br  />
denoting a [ action || event ] [ preceding , done in preparation for ] sth. fuller or more important
</p>
<pre class="example">
the [ preliminary ] mapping of the visible universe
The discussions are still at a [ preliminary ] stage.
</pre>
</div>
</div>
<div id="outline-container-sec-14-10" class="outline-3">
<h3 id="sec-14-10"><span class="section-number-3">14.10</span> premature</h3>
<div class="outline-text-3" id="text-14-10">
<p>
<b>adj.1</b> <br  />
[ early | untimely ] <br  />
[ uncommonly | unexpectedly ] early <br  />
[ occure , grow , exist ]ing before the [ normal || correct || expected || customary || assigned ] time <br  />
<code>+</code> end, death
</p>
<pre class="example">
a [ premature ] announcement
a man suffering from [ premature ] baldness
Illness led to his [ premature ] death.
事故仍然是美国人非自然死亡的首要原因。&gt;&gt; Accidents are still the number one cause of [ premature ] death for Americans.
他的职业生涯因连续的膝伤[ 过早 ]地结束了。&gt;&gt; His career was brought to a [ premature ] end by a succession of knee injuries.
</pre>

<p>
<b>adj.2</b> <br  />
[ impulsive | hasty ]
</p>
<pre class="example">
a [ premature ] judgment
目前，他们的乐观好像还[ 为时过早 ]。&gt;&gt; It now seems their optimism was [ premature ].
</pre>

<p>
<b>adj.3</b> <br  />
preterm <br  />
born after a gestation period of less than the normal time
</p>
<pre class="example">
a [ premature ] infant
a greater risk of having a [ premature ] baby
</pre>
</div>
</div>
<div id="outline-container-sec-14-11" class="outline-3">
<h3 id="sec-14-11"><span class="section-number-3">14.11</span> premise</h3>
<div class="outline-text-3" id="text-14-11">
<p>
<b>n.1</b> <br  />
[ proposition | assumption | hypothesis ] <br  />
an [ assertion || proposition ] which forms the basis for a [ work , theory ]
</p>
<pre class="example">
the fundamental [ premise ] of the report
the [ premise ] that human life consists of a series of choices
The [ premise ] of biodata is that “behavior predicts behavior.”
</pre>
</div>
</div>
