general/english/en_vocab.org
** prerequisite

*adj.1* \\
[ necessary | mandatory | essential | indispensable ] \\
required [ beforehand | in advance ] \\
[ required || necessary ] as a prior condition
: Competence is [ prerequisite ] to promotion.
: Young children can be taught the [ prerequisite ] skills necessary to learn to read.

*n.1* \\
< prerequisite for > \\
[ precondition | requirement ] \\
sth. required as a prior condition \\
sth. required [ beforehand | in advance ]
: Latin was a [ prerequisite for ] admission.
: An interest in children is [ prerequisite for ] a teacher.
: 良好的自尊心是幸福生活的[ 先决条件 ]。>> Good self-esteem is a [ prerequisite for ] a happy life.
* R
** rig

vt.1 \\
to [ manipulate | tamper with ] \\
to [ manage , conduct ] sth. fraudulently so as to produce a [ result || situation ] that is advantageous to a particular person
: The results of the elections had been [ rigged ].

* S
** save

*prep.1* \\
[ except | other than | apart from ]
: No one needed to know [ save ] herself.
: We are not trying to be complete or even precise, [ save ] that the examples are meant to be correct.

** seed

vt.1 \\
to cause sth. to begin to [ develop | grow ]
: severance payouts that help [ seed ] their new businesses

** supplement

*vt.1* \\
to [ augment | boost | increase ] \\
to add an extra [ element , amount ] to
: She took the job to [ supplement ] her husband's income.
: They [ supplemented ] their incomes by waiting tables on weekends.

* W
** wear

*v.1* \\
< wear well > \\
to [ last | endure | hold up ] \\
to withstand continued [ use , life ] in a specified way
: a carpet-type finish seems to [ wear well ]
: The tires are [ wearing well ].
