general/english/en_vocab.html
<div id="outline-container-sec-14-12" class="outline-3">
<h3 id="sec-14-12"><span class="section-number-3">14.12</span> prerequisite</h3>
<div class="outline-text-3" id="text-14-12">
<p>
<b>adj.1</b> <br  />
[ necessary | mandatory | essential | indispensable ] <br  />
required [ beforehand | in advance ] <br  />
[ required || necessary ] as a prior condition
</p>
<pre class="example">
Competence is [ prerequisite ] to promotion.
Young children can be taught the [ prerequisite ] skills necessary to learn to read.
</pre>

<p>
<b>n.1</b> <br  />
&lt; prerequisite for &gt; <br  />
[ precondition | requirement ] <br  />
sth. required as a prior condition <br  />
sth. required [ beforehand | in advance ]
</p>
<pre class="example">
Latin was a [ prerequisite for ] admission.
An interest in children is [ prerequisite for ] a teacher.
良好的自尊心是幸福生活的[ 先决条件 ]。&gt;&gt; Good self-esteem is a [ prerequisite for ] a happy life.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> R</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> rig</h3>
<div class="outline-text-3" id="text-15-1">
<p>
vt.1 <br  />
to [ manipulate | tamper with ] <br  />
to [ manage , conduct ] sth. fraudulently so as to produce a [ result || situation ] that is advantageous to a particular person
</p>
<pre class="example">
The results of the elections had been [ rigged ].
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> S</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> save</h3>
<div class="outline-text-3" id="text-16-1">
<p>
<b>prep.1</b> <br  />
[ except | other than | apart from ]
</p>
<pre class="example">
No one needed to know [ save ] herself.
We are not trying to be complete or even precise, [ save ] that the examples are meant to be correct.
</pre>
</div>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> seed</h3>
<div class="outline-text-3" id="text-16-2">
<p>
vt.1 <br  />
to cause sth. to begin to [ develop | grow ]
</p>
<pre class="example">
severance payouts that help [ seed ] their new businesses
</pre>
</div>
</div>
<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> supplement</h3>
<div class="outline-text-3" id="text-16-3">
<p>
<b>vt.1</b> <br  />
to [ augment | boost | increase ] <br  />
to add an extra [ element , amount ] to
</p>
<pre class="example">
She took the job to [ supplement ] her husband's income.
They [ supplemented ] their incomes by waiting tables on weekends.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> W</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> wear</h3>
<div class="outline-text-3" id="text-17-1">
<p>
<b>v.1</b> <br  />
&lt; wear well &gt; <br  />
to [ last | endure | hold up ] <br  />
to withstand continued [ use , life ] in a specified way
</p>
<pre class="example">
a carpet-type finish seems to [ wear well ]
The tires are [ wearing well ].
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-10-26 周三 22:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
